[
{"Name": "Alcatroz Xplorer C3300 Silent USB Wired Keyboard & Mouse Combo", "Price": 9.9, "Rating": 4.842045454545454},
{"Name": "SG Local GTX300 LED Gaming Keyboard and Mouse Set Mechanical Keyboard with 7 Colour Illuminated Light for Gaming Office", "Price": 9.8, "Rating": 4.640973630831643},
{"Name": "Alcatroz JellyBean U200 Slim USB Wired Keyboard", "Price": 9.9, "Rating": 4.8293333333333335},
{"Name": "[Ready Stock SG] N520 Keyboard Mouse Combo Wireless Vintage Gaming With Round Key Caps Mechanical Feel Keyboard", "Price": 20.5, "Rating": 4.818181818181818},
{"Name": "Wireless Bluetooth Keyboard and mouse full set mobile phone i Pad tablet laptop learning office mute color Mini Touch screen", "Price": 10.9, "Rating": 4.8495670995671},
{"Name": "Logitech K120 Wired Keyboard for Windows, USB Plug-and-Play, Full-Size, Spill Resistant, Curved Space Bar PC/Laptop", "Price": 15.0, "Rating": 4.943609022556391},
{"Name": "Magic Keyboard Black for 12.9 inch iPad Pro (5th Generation)", "Price": 519.0, "Rating": 5},
{"Name": "(Original) Logitech K120 USB Keyboard 3 Years Singapore Warranty  920-002582", "Price": 12.78, "Rating": 4.909246575342466},
{"Name": "[SG Stock] Leaven K550/K620 Mechanical Gaming Keyboard (Ultra Compact) Laptop Macbook Windows Mac OS Compatible", "Price": 20.5, "Rating": 4.909090909090909},
{"Name": "🇸🇬 K610 Wireless Keyboard USB Interface Office Business Portable Ergonomic Keyboard", "Price": 17.5, "Rating": 4.930909090909091},
{"Name": "[Local Stock] N520 Wireless Keyboard mouse Pastel Pink and Blue Green", "Price": 19.74, "Rating": 4.944741532976827},
{"Name": "Alcatroz Xplorer M550 Multimedia USB Wired Keyboard", "Price": 9.9, "Rating": 4.866666666666666},
{"Name": "Strange Cat Keycaps XDA Profiles 131Keys PBT Dye-Sublimation Compatible RK61 RK71 61/71/84/108 Keys Mechanical Gaming Keyboard Keycap", "Price": 23.7, "Rating": 0},
{"Name": "Lenovo/ HP / Dell  / Acer Branded USB Wired Keyboard & USB Optical Wired Mouse (Refurbished) - BLACK", "Price": 4.1, "Rating": 4.25},
{"Name": "HP USB Slim Business Keyboard", "Price": 12.9, "Rating": 4.95},
{"Name": "PBT Mechanical Keyboard Keycap XDA Profile Sublimation Suitable for 104 98 87 84 68 64 61 Keyboard Keycaps", "Price": 19.37, "Rating": 4.898692810457517},
{"Name": "Logitech MK215 Wireless Keyboard and Mouse Combo for Desktops and Laptops", "Price": 26.9, "Rating": 4.872523686477175},
{"Name": "FREE - Logitech K380 K580 K470 Leather Keyboard Bag Storage Bag Light and Thin Portable Liner Dustproof Keyboard Cover", "Price": 1.5, "Rating": 4.848249027237354},
{"Name": "Leaven K550/K620 Mechanical Gaming Keyboard (Ultra Compact) Laptop Macbook Windows Mac OS Compatible", "Price": 23.9, "Rating": 4.9037037037037035},
{"Name": "RGB 104 Keys Gaming Mechanical Touch Keyboard Led Backlit Usb Keyboard Gamer Built-in Steel Plate Ergonomic Keyboard", "Price": 19.5, "Rating": 4.651898734177215},
{"Name": "Japanese MinimalistinsGirls' Mouse Pad Oversized Men's Computer Keyboard Desk Pad Slide Pad", "Price": 9.5, "Rating": 4.885245901639344},
{"Name": "Alcatroz X-Craft XKB 100 Spill Proof Gaming Keyboard with Backlight Effect", "Price": 10.9, "Rating": 4.844827586206897},
{"Name": "New Pudding Keycap OEM Profile PBT Material RGB Light Transmission Mechanical Keyboard Keycaps 115 Keys", "Price": 14.69, "Rating": 0},
{"Name": "In Stock  NextDay Shipping MIIIW Keyboard Mouse Set RF 2.4GHz Wireless Office For Windows PC", "Price": 21.5, "Rating": 4.831265508684863},
{"Name": "(Local SG Brand) CR Group CR-808 2.4G Wireless Lightweight Keyboard with Numeric Keypad Combo (1 USB Dongle only)", "Price": 14.9, "Rating": 4.746376811594203},
{"Name": "Original MIIIW RF 2.4GHz Wireless Office Keyboard Mouse Set Compatible Portable USB Keyboard", "Price": 21.5, "Rating": 4.822097378277154},
{"Name": "GTX300 Mechanical Gaming Keyboard and Mouse Set LED Backlight Mechanical RGB Mechanical Home Wired Keyboard Mouse Set", "Price": 11.99, "Rating": 1},
{"Name": "CH [READY STOCK] Sea Coral SpaceBar PBT Five Sides Dye-Subbed 6.25U OEM Profile Keyboard Keycap", "Price": 6.93, "Rating": 4.638888888888889},
{"Name": "[Ready Stock SG] N520 Keyboard Mouse Combo Wireless Vintage Gaming With Round Key Caps Mechanical Feel Keyboard", "Price": 22.9, "Rating": 4.904823151125402},
{"rating": 2},
{"Name": "🔥LOCAL STOCK🔥Ergonomic Keyboard Mouse Wrist Rest Memory Foam", "Price": 5.9, "Rating": 4.92},
{"Name": "Lipstick color 86 keys retro round wireless keyboard and mouse set punk portable typewriter games keyboards and combos", "Price": 19.9, "Rating": 0},
{"Name": "[SG Local Seller] Mini Slim Keyboard Multimedia USB Wired For Notebook Laptop PC Computer", "Price": 12.5, "Rating": 4.9},
{"Name": "MOFII Bluetooth keyboard use for Mac/i pad/laptop/desktop Bluetooth keyboard/mouse", "Price": 25.0, "Rating": 4.915254237288136},
{"Name": "Minions Wireless Keyboard/Mouse/Mouse Pad/Phone Holder/Tumbler", "Price": 5.9, "Rating": 5},
{"Name": "Casio 61 keys Keyboard Bag Non-padded suitable for Casiotone CT-S Series and LK-S Series", "Price": 29.0, "Rating": 4.967391304347826},
{"Name": "GMK Fog PBT Keycap Cherry Profile for 61 / 68 / 87 / 104 Key Mechanical Game Keyboard Keycaps", "Price": 35.6, "Rating": 4.978260869565218},
{"Name": "K550 Mechanical Gaming Keyboard Office Keyboard School Keyboard for PC", "Price": 24.9, "Rating": 0},
{"Name": "MageGee Mini 60% Mechanical Keyboard Wired LED Backlit Compact Gaming Keyboard Blue / Red Switch Keyboard for Laptop", "Price": 36.9, "Rating": 4.927272727272728},
{"Name": "【SG 6.6】SuchWOW MOFII Wireless Multi-Colour Keyboard&Mouse set", "Price": 14.9, "Rating": 5},
{"Name": "Dareu A87 KB Yellow/Black Grey/Cherry MX Hotswap USB Wired/Wireless RGB LED Backlit Mechanical Gaming Keyboard", "Price": 89.0, "Rating": 4.857142857142857},
{"Name": "【Cute Cartoon Bear】Keyboard cover For MacBook New Pro14/16 M1 2020 Air13 Pro13.3 Retina A1502 A1466 A1706 touchbar Pro13 15inch  Waterproof keyboard cover", "Price": 4.9, "Rating": 4.8},
{"Name": "[TKSO] BOW K610 78 Keys Typewriter Style Mini USB Wireless Keyboard", "Price": 17.5, "Rating": 0},
{"Name": "Hammerhead Shark Keycap Doubleshot OEM Profile 135keys fit 61 68 71 84 87 100 104", "Price": 37.99, "Rating": 5},
{"Name": "Ultra Thin USB Wired Keyboard For Desktop Computer Laptop PC", "Price": 9.99, "Rating": 4.809045226130653},
{"rating": 5},
{"Name": "DYNACORE - Logitech MK270R Wireless Keyboard and Mouse Combo (3 years Local Warranty)", "Price": 33.8, "Rating": 5},
{"Name": "GMK Soyamilk Keycap Cherry Profile 135 keys PBT DYE SUB mechanical keyboard keycap set", "Price": 29.0, "Rating": 5},
{"Name": "New ZY-QW02 2.4G Wireless Bluetooth Keyboard Mouse Set for Office Work Girls Colorful Cute Lipstick Punk", "Price": 19.9, "Rating": 0},
{"Name": "SeenDa Mini Bluetooth Keyboard with Touchpad for Smart TV Projector Compatible with Android iDS Windows", "Price": 21.9, "Rating": 4.872727272727273},
{"Name": "Winnie The Pooh Disney Silent Wireless Mouse Wireless Retro Keyboard POOH PIGLET ROYCHE", "Price": 26.99, "Rating": 4.937219730941704},
{"Name": "RK61 RGB Gaming Mechanical Keyboard Wired Type-C / Wireless Bluetooth + 2.4G Dongle 61 Keys 60% 3-mode Multi-Keyboard", "Price": 46.75, "Rating": 4.859649122807017},
{"Name": "Feker 10 30 50 PCS 5 Pin to Holy matcha Switch Mechanical Keyboard Switch Replacement Tactile Polycarbonate Top Housing", "Price": 4.4, "Rating": 0},
{"Name": "Free shipping Ready stock Lychee gaming G66/G66pro mechanical keyboard white transparent Replacement Frame RGB back light cover barebone kit gasket mounted", "Price": 15.99, "Rating": 5},
{"Name": "BAJEAL K100 Two-Color Keyboard 87-Key Green Axis Keycap USB Wired Mechanical Keyboard Gaming(White+Pink)", "Price": 26.54, "Rating": 4.888888888888889},
{"Name": "✅[SG Ready Stock]N520 wireless keyboard and mouse set punk mechanical hand feeling keyboard and mouse set", "Price": 21.5, "Rating": 4.876436781609195},
{"Name": "LT 104 Key Mute Mechanical Gaming Keyboard and Mouse Set Game Office Keyboard Wired USB interface", "Price": 25.97, "Rating": 4.833333333333333},
{"Name": "NOVO Fashion Flash Eye Shadow Keyboard Finger Eye Shadow Plate Nine Color Stereo Eye Shadow", "Price": 8.9, "Rating": 0},
{"Name": "Bluetooth Keyboard  / 2 In 1 Wireless Bluetooth Mouse / Premium Quality / Local Seller / Fast Shipping !!", "Price": 3.9, "Rating": 4.6},
{"Name": "SeenDa Folding Wireless Bluetooth Keyboard Rechargeable Keypad with Touchpad Mini Keyboard for Phone Tablet Laptop", "Price": 28.9, "Rating": 5},
{"Name": "Macaron Theme Keycap 146 Key XDA Height PBT Sublimation Suitable for Mechanical Gaming Keyboard Keycaps", "Price": 27.4, "Rating": 5},
{"Name": "【SG】Wireless Keyboard and Mouse Combo Set with Phone Holder Typing Mute Waterproof Backlit Bluetooth Mechanical Design", "Price": 34.9, "Rating": 5},
{"rating": 5, "comment": "Received but haven’t test it out yet"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "fast delivery and items in very good condition"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Performance:haven try but i believe its good.\nBest Feature(s):durable\nValue For Money:yes it is, with mouse and mousepad\n\nGood."},
{"rating": 5},
{"rating": 5, "comment": "Came within 4 days! Keyboard is just nice for daily use:)"},
{"rating": 2, "comment": "The number pad lock key is not working. \nFast delivery in 2 days.\n5 star if the number pad lock is working."},
{"rating": 5},
{"rating": 4},
{"rating": 5, "comment": "Received in good condition, hope it can functioning well, happy with the quality "},
{"rating": 5, "comment": "Item received in working condition tho no bubble wrap was wrapped around the packaging.\nMouse-clicks are silent 👍"},
{"rating": 5, "comment": "Box was so much bigger than expected haha but delivered promptly and overall great purchase! "},
{"rating": 5, "comment": "very fast delivery... and very quiet! nice keyboard and mouse!"},
{"rating": 5, "comment": "Works well, like the feel of the keyboard. Comes with battery toon"},
{"rating": 5, "comment": "Received in good condition. Worth the price."},
{"rating": 5, "comment": "Product is similar to what was posted by seller. No defects found. Will try it soon."},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "fast delivery, colour is pretty and typing sound is very loud"},
{"rating": 4, "comment": "Value for money."},
{"rating": 4, "comment": "Well received and simple love it..."},
{"rating": 5},
{"rating": 5, "comment": "chose these keys for my setup hehehe the letter keys were abit like confusing to see which is which @@ oh and i didnt realise that it was XDA till i received it.. but still like doesnt feel much different frm cherry profiles thankfully"},
{"rating": 1, "comment": "Product quality is poor..."},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Connects easily to my ipad with full function."},
{"rating": 5},
{"rating": 3, "comment": "its a bluetooth 3.0 . others is 5.2. also, battery compartment is poor. the first mouse i buy cannot work. no replacement.  the 2nd mouse i buy have to fix the battery compartment to work. in general, mouse can work. after some fixing."},
{"rating": 5, "comment": "Pros: Well made. Small & compact \n\nCons: Bluetooth disconnects every ~20mins of inactivity. Impossible to reconnect without removing device & re-sync again. Such a pain for peeps who are in & out of meetings & not using keyboard continuously. Not recommended for this reason."},
{"rating": 5, "comment": "Best Feature(s):no dongle\nValue For Money:yes.\nPerformance:Acceptable\n\nKeyboard can type uninterupted claims 150hrs without backlight. 👍👍"},
{"rating": 5},
{"rating": 5, "comment": "Items received as ordered, very light, works as expected. Thanks!"},
{"rating": 5, "comment": "Nice crunchy key strokes without the noise. Great value for a mechanical keyboard. Better if adds button shortcut labels like volume and brightness control. 👍"},
{"rating": 5, "comment": "Very nice keyboard"},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "It came in good condition, the lights is bright and every keys worked."},
{"rating": 5, "comment": "Very difficult to key."},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Very prompt seller. Willing to buy again.👍"},
{"rating": 4},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 4},
{"rating": 5, "comment": "Fast delivery. Receive within 2 days after purchased. Love the clicking sound its not too loud."},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Cute."},
{"rating": 5, "comment": "It work & function well if you need need covers."},
{"rating": 5},
{"rating": 5, "comment": "Fast delivery! Item came 1 day after I order!!! Buttons work well and pink is so pretty!"},
{"rating": 5},
{"rating": 5, "comment": "-"},
{"rating": 3, "comment": "Keys are not very responsive but colours are very pretty."},
{"rating": 5},
{"rating": 5, "comment": "Very good buy. Smooth in typing n I like the sounds the keys click 😊👍🏼"},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Well packaged. Bought as gift. Yet to try it."},
{"rating": 5, "comment": "nice"},
{"rating": 5, "comment": "Really pretty… delivery was prompt!"},
{"rating": 5, "comment": "Fast delivery and easy to use."},
{"rating": 5, "comment": "It takes a while to get adjusted to the keyboard but product works well. The colours make my desktop looks less dull."},
{"rating": 5, "comment": "item delivered next day and in good condition."},
{"rating": 5, "comment": "Fast delivery. Item delivered in good packaging."},
{"rating": 5, "comment": "Delivered in two days after order! Very fast delivery! Keyboard n mouse work well. Highly recommend."},
{"rating": 5, "comment": "Love the colour! Sadly I can’t seem to turn off the keyboard, only when I am taking out the battery in it.\n\nOther than that seems good for an affordable price!👍🏻"},
{"rating": 5, "comment": "Love the color. Love that there is a keyboard cover to prevent dust. \nWorking fine."},
{"rating": 5, "comment": "Ordered black, seller informed no stk so chg to green. Nd to get used to it Love the sound. Delivery svc = bad. Status on 8 sep = parcel out for delivery, only got it on 9 sep. Guy tried to slot item between gate but failed. It almost dropped when i open door. 🤦‍♀️\nSpace bar get stuck often. 😔"},
{"rating": 5, "comment": "keyboard and mouse is super nice and hope it last! and very fast delivery within a day , Thank you seller!"},
{"rating": 5, "comment": "Love it"},
{"rating": 3, "comment": "Speedy delivery! Ordered and received in 2 days time and the turquoise color one looks very nice.\n\nEdit: one of the mouse doesn't works as intended (can click but cannot move, sensor problem probably) so it's a bit disappointing"},
{"rating": 5, "comment": "Love it sooo much. Great buy. Highly recommended. Fast shipping"},
{"rating": 5, "comment": "Look Nice and fast delivery.."},
{"rating": 5, "comment": "Items are pretty good for ppl with long hours in front of computer screen. Love the keyboard. Mouse sometimes a lil lag. Otherwise they are pretty good!"},
{"rating": 5, "comment": "Delivery was fast. Well packed. Doesn't hv the click sound when typing. Overall it was a satisfied purchased. Thumbs up. Worth buying."},
{"rating": 5, "comment": "Bought it for the keyboard. It's really pretty and nice to type."},
{"rating": 5, "comment": "received in less than 5days. easy setup. love the aesthetic of it!"},
{"rating": 5, "comment": "Ordered lipstick color but seller messaged me to say that it is out of stock. Chose turquoise color instead. Tested the keyboard and mouse and they work."},
{"rating": 5, "comment": "1st purchase.  Nice colours. Comes with 1x AA + 2x AAA batteries. Did a typing test with the lazy dog = missed some keys but can get used to it. Hope the connection works smoothly."},
{"rating": 5, "comment": "Fast delivery. Good product. My kid loves it. Happy"},
{"rating": 5},
{"rating": 5, "comment": "Well packed and fast delivery, read good reviews so trying for the first time"},
{"rating": 5, "comment": "Try prompt delivery. Items as depicted in post and pics. Super pretty."},
{"rating": 5, "comment": "The delivery is super fast, packaging was good. And so far its working well"},
{"rating": 5, "comment": "Nice pretty keyboard. The buttons are protruded instead of embedded ones. Easier to keep clean. Batteries provided and the mouse is comfortable to hold. \nOnly issue is no power on/off switch on the keyboard."},
{"rating": 5, "comment": "Keys feel good. Delivery super speedy. Keyboard very pretty!"},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "extremely pleased actually. came well wrapped. pdt works well. the keyboard is soft and good. received in 3 days. good."},
{"rating": 5, "comment": "It has one of the best keyboard sounds I’ve heard and good feel to it. Best purchase by far! Thank you!"},
{"rating": 5, "comment": "item received in good condition. \nkeyboard typing is smooth. \nmouse click is not silent. \nVery good price 👍🏻👍🏻 \nOnly have 1 USB to connect both the keyboard and mouse...love it ❤"},
{"rating": 3},
{"rating": 5},
{"rating": 5, "comment": "Very fast delivery. Wfh and my previous keyboard died on me so this came fast enough to replace it. Good buy"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 4},
{"rating": 5},
{"rating": 3, "comment": "Editing my initial 5 stars review: after a few days of average usage some of the letters I typed are not inputted correctly 😭 either not received by my laptop at all or sequence of letters is somewhat jumbled.. gutted bc I loved the keyboard so much 😭 it still works but kinda annoying to use.."},
{"rating": 5, "comment": "I love itttt, is so niceee. And the box came nicely packed and sealed tight, no damages or smashed parts. Thank you!! :)"},
{"rating": 5},
{"rating": 5, "comment": "😍😍😍😍"},
{"rating": 5, "comment": "Item reveived in good condition and fast delivery"},
{"rating": 5},
{"rating": 5, "comment": "works well!! lights cannot turn off tho or maybe i didnt read the manual properly. the clack clack sound a bit loud so may need to get used to it"},
{"rating": 5, "comment": "Prompt delivery."},
{"rating": 5, "comment": "Item received in well condition. 👍🏻"},
{"rating": 5, "comment": "The sound is really click really like it"},
{"rating": 5, "comment": "love the clicky sound.\nfast delivery.\nthere are some button abit off but with the price paid, happy with the purchase."},
{"rating": 5, "comment": "delivery took a week! i was so excited for it to come and it finally has arrived! so far so good, the lights are super pretty and the keyboard is cute! worth the money for a wired keyboard! quite the hassle to use connect it to an adaptor as im using a macbook, but using it at home won’t be a worry!"},
{"rating": 5, "comment": "definitely worth the money if you can’t spend much on a high end keyboard but just want a cute mech :))"},
{"rating": 5, "comment": "fast delivery and item received in good condition very nice sound for cheap thank you seller"},
{"rating": 5, "comment": "Highly recommended!!! ⭐️⭐️⭐️⭐️⭐️\nOk whoever reads this, stop looking at other shops! THIS IS THE BEST KEYBOARD EVER. TYPING ASMR 💯 Super chio keyboard + the font of the keycaps is so asthetically pleasing omg. & It is also so affordable?!?! I can’t believe this. So happy to have found this!"},
{"rating": 5, "comment": "Came as described and in secure packaging. Instructions manual was not very informative but YouTube and Google made do. Satisfied with purchase"},
{"rating": 5, "comment": "Order arrived on the following week. Item is as described. Thank you seller."},
{"rating": 5, "comment": "super love it!! matches my pink set up so well, its so pretty and the keyboard has a great clicky sound, comes with 2 extra switches and a key/switch puller too!"},
{"rating": 5, "comment": "bought for my sister and she is happy with the purchase!!!!!!"},
{"rating": 5, "comment": "super affordable mechanical keyboard, comes with blue clicky switches. hot swappable. overall very good purchase 👍👍👍"},
{"rating": 5, "comment": "Ordered on 3 Mar & received on 13Mar22 with good condition. The click click sounds and the lighting are so cool.....Good deal."},
{"rating": 4, "comment": "I luv the sound n it came 5 days after ordered which is quite fast but the letter p is flickering but its fine ig"},
{"rating": 5, "comment": "this keyboard is a beauty"},
{"rating": 5, "comment": "Prompt delivery and the keyboard came safely. Very nice and will come back to look out for more!"},
{"rating": 5, "comment": "Excellent tactile feel. No loose keycaps. Bluetooth connection is stable but it's inconvenient to toggle it on and off (switch is on the bottom). The RK61 is one of the best budget mechanical keyboards you can find."},
{"rating": 5, "comment": "5 stars, it would be better if u can provide manual to set up.  Overall, super satisfy with product👍👍"},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Took awhile to receive but item well wrapped and protected. Thanks"},
{"rating": 4, "comment": "Very good quality but number keys somehow don’t work . Any tips . And also the QR code on the instructions don’t work . Please help thank you"},
{"rating": 5, "comment": "My son loves the keyboard and the sound.. ….good buy! Thank you"},
{"rating": 5, "comment": "Just received the order and it looks like it came in good condition, came with brush a few switches and keycap puller and switch puller as well as the fre gift keybaord bag!!!thanks!! Happy with purchase"},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Nice and cute"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Nice.."},
{"rating": 5},
{"rating": 5},
{"rating": 3},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Item received as described! Highly recommended!"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Fast delivery, thanks seller!"},
{"rating": 5, "comment": "It’s so cuteee !! Keyboard is light, and keys are easy to type. Loving it !! \n\nP.s May be a little noisy for people that cannot stand loud typing sound."},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Really very silent!"},
{"rating": 5, "comment": "Received in n good condition. It’s a gift so have not tested yet."},
{"rating": 5, "comment": "Have a feel of the mouse and keyboard.. quality not bad... Have not use yet..."},
{"rating": 5, "comment": "Love it!! Well packed. A little high for me since my table is quite high. But overall good to use!"},
{"rating": 5, "comment": "It took a while to deliver. Quality looks great!"},
{"rating": 5, "comment": "Love it, very pretty. Received in good condition,  a gift for a friend, hope she likes it. Thanks seller 😁"},
{"rating": 5, "comment": "super cute and nice, the packaging is super awesome and tight and it comes within 1 to 1.5 weeks time. i would say it’s worth it !!"},
{"rating": 5, "comment": "one of my best buys from shopee. although it took quite long to deliver, the parcel was well packaged and the product was as described!!"},
{"rating": 5, "comment": "Item received for my friend and hope it looks good! Good price!"},
{"rating": 5, "comment": "Fast delivery, the quality of the product good. Super cute and love it."},
{"rating": 5, "comment": "super cute!! delivery is quite fast and well-packaged!! thank uuuu"},
{"rating": 5, "comment": "Item received in good condition.Love it very much, it is very cute."},
{"rating": 5, "comment": "Super cute piglet keyboard. Works well too. Just brightens up my day!"},
{"rating": 5, "comment": "Super cute mouse! It’s a gift. Hopefully it works well. Items are well packed."},
{"rating": 5, "comment": "Delivery took about two weeks as it came from Korea. Got it as a gift and package was well wrapped."},
{"rating": 5, "comment": "The item is 👍🏻 good and cute. Its not for me, its for a gift 🎁. Friend told the item is okay and cute 🥰."},
{"rating": 5, "comment": "Took quite some time to arrive. Silent kb quite nice. But pink plastic looks cheap. Eay to connect. Triple A batt provided"},
{"rating": 5, "comment": "Cute keyboard but not very springy like mechanical keyboard 😂"},
{"rating": 5, "comment": "Item work well. Great"},
{"rating": 5},
{"rating": 5, "comment": "Keyboard is small and compact good for Android TV.\nKeys and mouse controls are ergonomically laid out.\nInstead of using the TV remote now I can input search with keyboard."},
{"rating": 5},
{"rating": 5, "comment": "Works well \n\nHappy with my purchase"},
{"rating": 5, "comment": "Good buy. It works well. Thanks. "},
{"rating": 5},
{"rating": 5, "comment": "Perfect for minipc entertainment in my room. Good product!"},
{"rating": 5, "comment": "Item received in good condition. Order on 18/11 and received it on 7/12. Try it and  working well. Thank you..."},
{"rating": 5},
{"rating": 5, "comment": "Nice keys good quality and took quite fast to deliver considering public holiday and weekend. Definitely recommend :)"},
{"rating": 5, "comment": "Performance:packed nicely\n\nHave not tested yet, hope it work fine with my TV."},
{"rating": 5, "comment": "Overall value for money. Ordered this wireless keyboard and mouse together with a 27” monitor, but they arrive a day apart. Almost couldnt find the wireless receiver. See photo for where to locate on the box. Happy with my purchase! Logitech is the trusted brand for keyboard and mouse. "},
{"rating": 4, "comment": "Fast and responsible delivery in well condition. Only the keyboard is not that soft, make a loud sound while typing. "},
{"rating": 5, "comment": "It is a ewaste. The buttons do not work properly and letter does not match the keyed in button....."},
{"rating": 5, "comment": "Good product and in good working condition😊"},
{"rating": 5},
{"rating": 5, "comment": "This is my 2nd purchase.  Fast Delivery.  Good quality Keyboard.......................,........................"},
{"rating": 5},
{"rating": 4, "comment": "Acceptable for the price."},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Working fine and highly cost performance"},
{"rating": 5, "comment": "Tested it works hope it lasts 🙏 👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍"},
{"rating": 5},
{"rating": 2, "comment": "Typing experience not great. Some keys are not sensitive, and keyboard is not stable. It rocks when you type."},
{"rating": 5},
{"rating": 5, "comment": "Delivery time is relatively fast. Keyboard is the small kind like a 12 inch laptop kind of size. Typing sound can be a bit loud but not an issue for me. Great purchase for the price point! 👍"},
{"rating": 5, "comment": "Delivery is fast and the keyboard works well. Value for money. Highly recommended..."},
{"rating": 5},
{"rating": 5, "comment": "Keyboard is in good working condition and small size. Good space saving keyboard."},
{"rating": 5, "comment": "Arrived about one week after order. Quite good and light. Worth it"},
{"rating": 5, "comment": "well packed & fast delivery."},
{"rating": 5, "comment": "Good value for money!!! Recommended for those who don’t want to spend too much on a keyboard!"},
{"rating": 5, "comment": "Very compacted size for my use . Good and light weight . Thanks to the seller. Thanks"},
{"rating": 5, "comment": "Keyboard button a bit hard to press . Deliver take about 8 to 10 days arrived . Product deliver from Singapore . "},
{"rating": 5, "comment": "Perfect gift for the perfect friend. Thank you so much for the prompt shipping as always!\n\n😘"},
{"rating": 5, "comment": "Nice and fast . Thanks you seller !"},
{"rating": 5, "comment": "Received in good condition. My laptop keyboard is not working and i’m lazy to go office for replacement. Happy for this keyboard."},
{"rating": 4, "comment": "Delivery was fast. Quality is acceptable. The Only thing its a bit too small for me. Its called mini"},
{"rating": 5, "comment": "Fast delivery and satisfied with the product. Nice and right size for laptop. Plug in and play. However, keyboard input is in reverse order. But believe will figure that out later."},
{"rating": 5, "comment": "The keycaps looks amazing. Quality is good but have yet to check the back to the keycaps should be ok from what i saw"},
{"rating": 5, "comment": "Delivery came after a week. Came intact in box and package. Thin and portable with nice clicking."},
{"rating": 5, "comment": "The size of keyboard is just so cute. Keyboard is little bit hard to type though, maybe it’s still new."},
{"rating": 5},
{"rating": 5, "comment": "Received the item and already tested.. recommend if anyone want to purchase, also fast delivery.. thank you so much.."},
{"rating": 5, "comment": "Great colours! The package is nicely done too. I hope the keyboard can last very long!"},
{"rating": 5, "comment": "Loving it with the icy blue backlight. Quality of keys look good."},
{"rating": 5, "comment": "Fast delivery within 3 days... Received in good condition... Working well"},
{"rating": 5, "comment": "good! design is cute. and free stickers as well for buying 2 pieces"},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "nice good quality everything nice"},
{"rating": 5, "comment": "good condition sexy switches"},
{"rating": 5},
{"rating": 5, "comment": "Good"},
{"rating": 5},
{"rating": 5, "comment": "Came after 1+ wk which is quite fast. It provides the USB cable, Keycap remover and also came with a free mat for the keyboard."},
{"rating": 5, "comment": "Good buy \nRecommended \nWorth it \nMy girl like it"},
{"rating": 4, "comment": "Performance:hopefully it last\nBest Feature(s):nil\nValue For Money:good\n\nKeys not competitable to some windows functions. Nevertheless good buy. Hopefully it last"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "VERY NICEEE. High quality keycaps at an affordable price"},
{"rating": 5},
{"rating": 5, "comment": "Came in after almost 2 weeks but is ok. Satisfied with purchase"},
{"rating": 5, "comment": "Good quality keycaps, fast delivery and looks very nice on my keyboard"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Items received in good condition. My kid love the piano so much. Cheaper than retail. Thanks seller for the free gifts."},
{"rating": 5, "comment": "Fast delivery! Perfect for beginners. Happy with the purchase."},
{"rating": 5, "comment": "Very nice set of keycaps, though the delivery time took a while. Worth the wait!"},
{"rating": 5, "comment": "Bag fits the keyboard with the book holder perfectly. Can also squeeze the charger inside the book holder compartment. Btw for beginners, fyi this bag cannot put the chair and keyboard stand inside! Overall it’s a good strong keyboard bag."},
{"rating": 5},
{"rating": 5, "comment": "Items received in good condition! Well done!"},
{"rating": 5, "comment": "Fast delivery and good condition. Good for beginners and the colour is nice."},
{"rating": 5, "comment": "Delivery to door step. Good packing 👍 and buy set value for money. Quality also good. Play for fun at home is good enough."},
{"rating": 5, "comment": "Fast delivery and received item in good condition. Bought this to keep my Casio 61 keys keyboard."},
{"rating": 5, "comment": "Happy with purchase. Come together free with keyboard. Fast delivery."},
{"rating": 5, "comment": "Fast delivery and I love it so much! Everything has been well received."},
{"rating": 5, "comment": "Items received within 5 working days. Everything seems ok and stool is comfortable"},
{"rating": 5},
{"rating": 5, "comment": "the keyboard is veryy prettyyy the delivery was okkk just a bit long and the seller is really friendly:)!!"},
{"rating": 5, "comment": "My minion mousepad is here. 🤗🤗🤗\nMakes my wfh not sooooo boring 😴 \nThank you for the small sticker on the package.\nI have peeled it and stick it on my laptop 😂"},
{"rating": 5, "comment": "Good keyboard. Arrived in good condition. Takes about a week and a half to arrive tho. Seller is friendly when contacted 😊"},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "cute"},
{"rating": 5, "comment": "Really love this keypad."},
{"rating": 5, "comment": "Order took 8 days, tried using it it's good overall, thanks for the cute sticker"},
{"rating": 5, "comment": "终于收到了，好可爱。小小一个圆圆，颜色也好好看。"},
{"rating": 5, "comment": "Pleased with the purchase. Seller provided prompt service and was patient with queries. Items delivered well packaged."},
{"rating": 5, "comment": "Fast delivery.. easily connected to both my mac and ipad.. also easy to switch from mac to ipad with a click of a button.. love it.. the keys need a little getting use to, but love the feel and sound of it.. thank you!"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Received in excellent condition for the item. Small and quality alright . Thank you so much"},
{"rating": 5},
{"rating": 5, "comment": "Shipping is really quick. Would be perfect for those with a lower keyboard height."},
{"rating": 5, "comment": "Good height for shorter keyboard. Comfortable and relieves pain on my wrists"},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Very nice.."},
{"rating": 5},
{"rating": 5, "comment": "So beautiful 😻😻"},
{"rating": 5},
{"rating": 5, "comment": "Fast delivery..friendly seller!"},
{"rating": 5, "comment": "Fast delivery... item as per shown."},
{"rating": 5},
{"rating": 5, "comment": "Ninjavan needs to work on their delivery timing and communication skills . Overall , package received was in good and working condition ."},
{"rating": 5, "comment": "Received good condition, fast drlivery too"},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Great! Love the keyboards. I bought 2!"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "seller was very understanding, Tk time to answer many of my queries abt è keyboard. delivery was very prompt & item recd in great conditn. love è classy pink buttons against è white board & hw tactile è keyboard feels. Hv been using è keyboard & my typing exp has never been better.highly recommend !"},
{"rating": 5, "comment": "Thank you seller.  Happy customer here 👍."},
{"rating": 4},
{"rating": 5},
{"rating": 4, "comment": "Nice keyboard and wireless mouse.  Both works fine with the same usb plugin."},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Good good good good Good good good good Good good good good Good good good good\n"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Works well. Love the colour and the feel of it. Not too loud so that is awesome for me. "},
{"rating": 5},
{"rating": 5, "comment": "fast delivery within 2 days received"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Very cute and smooth to type "},
{"rating": 5},
{"rating": 5, "comment": "came in good condition!! highly recommend to buy this!! :) "},
{"rating": 5, "comment": "Quick delivery and items received in working condition. "},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Usb dongle inside mouse. Seller friendly and helpful. Highly recommended and satisfied. Very prompt and reliable seller. This is good and worth to buy. Product is in good condition and is as posted without defects. Very pleasant experience, i am happy and will definitely purchase again in future."},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 4},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "super fast delivery and already using it now - loving the look and feel of the keyboard, seems easy to type on but the mouse is normal (no complaints just that the grip makes my hand feel fat). thanks!!"},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Fast delivery!"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 4},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Fast delivery and soooo nice"},
{"rating": 5},
{"rating": 5, "comment": "Seller help me with concerns 👍🏻"},
{"rating": 3},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Looks good so far, yet to try."},
{"rating": 5},
{"rating": 5},
{"rating": 4},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Seller very helpful \n🙏 thank u"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Very quick delivery! Worth the money as it comes with a mouse too!"},
{"rating": 3, "comment": "Not very good the key board, the cannot type very fast, type APPLE, another P always missing 😓😓\n\nCannot for office use, Need to buy another one"},
{"rating": 3, "comment": "Other than it was cheap, the keyboard doesn't really performing well, especially there is delay or the letter didn't display when you type fast on the keyboard. It only allows slow typing, and most of the time you miss the letter you typing. It doesn't perform as mentioned by others."},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 4},
{"rating": 5},
{"rating": 5, "comment": "Good"},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Good keyboard. Ordered on Tuesday, received two days later. Thank you!"},
{"rating": 2, "comment": "Nice but when tested the device, it is causing lag while typing most of the times and some key buttons is not working well so end up i can't use it, not sure if its something wrong with the wireless sensor part"},
{"rating": 5, "comment": "Well packaged and great quality"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Item received in good condition. Fast and message before delivery."},
{"rating": 2, "comment": "fast delivery but however i feel that the product quality is very lousy. don't feel like a $40 dollar product."},
{"rating": 5},
{"rating": 4, "comment": "Its ok."},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "The USB dongle is inside the mouse near the battery. The delivery is very good and we love the keyboard.The seller is good as well."},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 4},
{"rating": 5, "comment": "the keyboard is so pretty and the pressing soud is not noisy at all ! love it! will purchase again!"},
{"rating": 5, "comment": "Love the colours!!"},
{"rating": 5, "comment": "Works well"},
{"rating": 5},
{"rating": 5, "comment": "Not bad, it's nice already bring to my office used . I happy 😊"},
{"rating": 5, "comment": "It was a fast delivery. Quality is very good for the price. Not a fan of the included mouse but keyboard was good. Loved the style of it."},
{"rating": 5, "comment": "Wow..cute the colours.. I bought this for my daughter but I like too..again I purchased  thank yiu"},
{"rating": 5, "comment": "fast delivery via ninja van. Wireless works well with my pc. Really brighten up my workspace"},
{"rating": 5, "comment": "Super fast delivery. Came 2 days after i made the purchase. On the day of purchase Seller contacted me regarding small dent in the box, which is very nice of him. After i receive the box, the dent is very minor and doesnt affect anything on the keyboard. \nColour is nice. Recommended."},
{"rating": 5, "comment": "received it promptly! the keyboard is really pretty and the set up is easy and fast :-)"},
{"rating": 5, "comment": "My order arrived earlier than expected. Great that it comes with batteries for the keyboard and mouse! Thanks :)"},
{"rating": 4, "comment": "Superb! Cheerful and sweetly pleasant to the eyes. Soft touch."},
{"rating": 5, "comment": "Very fast delivery! \nLoving the keyboard! "},
{"rating": 5, "comment": "Worth the buy"},
{"rating": 5, "comment": "Looks good, customer service response is fast. Great!"},
{"rating": 5},
{"rating": 5, "comment": "Came well packaged and everything works nicely. Overall, satisfied with the purchase :)"},
{"rating": 5, "comment": "Order on 9.9 sales, didn't expect receive on the next day. Love the colour and fast delivery"},
{"rating": 5},
{"rating": 5, "comment": "Happy with the purchase :)"},
{"rating": 5, "comment": "Very nicely packed, received the items in 2 working days. Sturdy keyboard but the mouse lags a little. Not an issue for me though. Batteries given in the box, but do note that the battery type for mouse and keyboard is different. "},
{"rating": 5, "comment": "its actually quite big but its very nice and i really like it :)"},
{"rating": 5, "comment": "A crack on the keyboard, very disappointed but seller is so nice and will send me a new replacement. Thanks so much."},
{"rating": 5, "comment": "Arrived really quickly! Looks really classy and works well! "},
{"rating": 5, "comment": "super fast delivery with express delivery charge. repeat buyer; very satisfied with the product. good buy and v value for money!"},
{"rating": 5, "comment": "Repeated purchase. Delivery is quick. Keyboard is very pretty. Nice typing sound also."},
{"rating": 5, "comment": "The color is vibrant and so far works well. I love it. Good price deal and  Hope it will last long. Fast delivery as well."},
{"rating": 5, "comment": "Loving the design and colour! <3 Thanks for the free gift too!"},
{"rating": 5, "comment": "Bought the black colour wireless KB and mouse to replace old one.Product arrive fast and the performance is fantastic.Has mechanical typing feel and no delay at all even though it is wireless. Best thing is KB is super quiet.The overall vintage keycaps add to the Atas status also.Highly recommended!"},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Very fast delivery and prompt response from seller. We thought we didn't receive the usb but it is actually hiding inside the mouse as per the picture."},
{"rating": 5, "comment": "Quite good. My daugther likes it"},
{"rating": 5, "comment": "Item packaging , superb.\nCame wiz free Kermit the Frog keyholder.\nBut what I like most is the fast delivery."},
{"rating": 5, "comment": "Items received in good condition and delivery lead time was fast. Both keyboard and mouse working well. Value for money!"},
{"rating": 5, "comment": "Fast delivery! Received the next day. Love the colour of the keyboard :) good buy!"},
{"rating": 5, "comment": "Nice color and fast delivery and seller respond fast and helpful"},
{"rating": 5, "comment": "My daughter like it so much, ordered another set for her."},
{"rating": 5, "comment": "Love it"},
{"rating": 5, "comment": "Thanks seller for your fast delivery I love the item so much. Quality is very good and nice. Hope it work well. Will buy other item from you again"},
{"rating": 5, "comment": "so pretty and easy to connect! brightens my day. fast delivery and packed securely. :)"},
{"rating": 5, "comment": "Thank you super fast delivery within 3 days. Keyboard very smooth thank you."},
{"rating": 5, "comment": "Super fast delivery. Got it within a day after order. Good packaging. And keyboard works well"},
{"rating": 5, "comment": "Very fast delivery and my gal love the keyboard Color"},
{"rating": 4, "comment": "Yet to use but order came in well-packed and fast. Batteries are included. Items seem to be in good condition, hopefully they work well and last."},
{"rating": 5, "comment": "received in good condition and thx seller for the free gift...good to use, and nice colour"},
{"rating": 5, "comment": "Received well.\nFast delivery! \nHave yet to try"},
{"rating": 5, "comment": "Works well for macbook."},
{"rating": 5, "comment": "Received! Nice colour but cant try since for gifting though! Thank youuu seller! Quick delivery too!"},
{"rating": 5, "comment": "Fast delivery... looks sweet but clicking sound not as loud"},
{"rating": 4, "comment": "the keyboard is okay, not too loud of a clicking noise and the grip of the mouse is not too bad. the downfall is that u have to use the usb from the mouse in order to use the keyboard."},
{"rating": 5, "comment": "Lovin’ it. If the Amazon color’s back, please tell  😬"},
{"rating": 5, "comment": "come in a really good condition would definitely buy again :D"},
{"rating": 5, "comment": "Received with good condition"},
{"rating": 5, "comment": "Received my item with small gift. Thanks seller for well packaging and fast delivery. Hope it works well"},
{"rating": 5, "comment": "Nice and pretty. Look exactly as what was shown. Worth the price."},
{"rating": 5, "comment": "Ordered on 11 Apr, received it on 13 Apr. Tested it and everything is working well! Quite happy with the keyboard and mouse."},
{"rating": 3, "comment": "MACBook compatible. Lightweight. 3 stars were given because the keyboard can be irresponsive sometimes. Otherwise seller is prompt to assist."},
{"rating": 5, "comment": "Delivery is fast! Received item as per described, and only on the second day of ordering. Happy w purchase!"},
{"rating": 5, "comment": "Super fast delivery! And very happy with the product. Colors are very nice. Perfect for cheering up my mood in the office. I type quite hard and fast in general so this isn’t exactly a quiet keyboard for me but it makes a nice and satisfying sound. Definitely recommend."},
{"rating": 5, "comment": "Fast delivery! Simple design, works perfectly."},
{"rating": 5, "comment": "Received in good condition, nice colors.  Yet to try, hope it works well with my golden fingers. Lol."},
{"rating": 5, "comment": "The order came super fast! Hopefully it works well. Can’t wait to try!"},
{"rating": 5, "comment": "Came nicely packed. Lovely color. The mouse shape makes it awkward to use but still ok."},
{"rating": 5, "comment": "KEyboard and mouse set quality is very decent. Tested no issue at all. Just that u need to get used to typing with round buttons. Overall 8/10"},
{"rating": 5, "comment": "Very nice and colorful keyboard ever"},
{"rating": 5, "comment": "Well packed fast delivery all is good nice touch asmr feel haha"},
{"rating": 5, "comment": "Love it!"},
{"rating": 5, "comment": "received within 2 days! didnt know how to connect it at first but the seller was super responsive and replied immediately,, v satisfied w my buy"},
{"rating": 5, "comment": "love it!! Had some issues with it initially but seller was very prompt and very patient and nice in his post sales service. Thanks much!!"},
{"rating": 5, "comment": "Fast delivery, easy to use."},
{"rating": 5, "comment": "Keyboard works well and it has a nice design"},
{"rating": 5},
{"rating": 5, "comment": "Item was well received and in good condition. Highly recommended!"},
{"rating": 5, "comment": "Got the package in 2 days. Well-wrapped, easy to set up, and the keyboard is quiet (it's softer in real life compared to the video). The plastic cover that it came with helps to keep dust out."},
{"rating": 5, "comment": "Came with batteries. Fast delivery. Nice seller."},
{"rating": 5, "comment": "Fast delivery :) comes with battery for the mouse and keyboard too"},
{"rating": 5, "comment": "At $19, this is the cheapest keyboard and mouse set I’ve ever bought. It looks pretty good too."},
{"rating": 5, "comment": "Great purchase. Both colors look nice easy to install and clean"},
{"rating": 5, "comment": "very cute! parcel was packed nicely and i received it within 3 working days love it!"},
{"rating": 5, "comment": "Fast delivery, received in two days. Thank seller for the fast delivery. As Some Numbering on keyboard printed is not very clear."},
{"rating": 5, "comment": "So happy to receive this!! Thank you! Delivery was very fast!"},
{"rating": 5, "comment": "super good quality! looks damn dope too:) functionality is good as well, fast delivery!! highly recommended "},
{"rating": 4, "comment": "Delivery was pretty fast, keyboard working in good condition but they keys were kinda near each other which may cause error in \ntyping "},
{"rating": 5, "comment": "Got my parcel and I’m very satisfied with the product. It’s wrap in a good condition. And I loved that they provided free batteries for us to use on the keyboard/mouse first… very happy!"},
{"rating": 5, "comment": "Delivery was very fast and item received in good condition ! 👍🏻👍🏻👍🏻"},
{"rating": 5, "comment": "Order received in good condition. The keyboard sound is nice."},
{"rating": 5, "comment": "Fast delivery and value for money. The feeling of typing is vy smooth. Mouse also works well. "},
{"rating": 5, "comment": "Product was well packaged and delivery was pretty fast. Quite satisfied"},
{"rating": 5, "comment": "Received in good condition, color as advertised. Bought it as a gift and I'm really happy with how it turned out. Delivery was v prompt, ordered on Sat night and received it by tues. Thanks seller! "},
{"rating": 5, "comment": "Love the keyboard v much! Worth every $ spent.. Quite light n keys are nice to press."},
{"rating": 5, "comment": "Quite large as compared to hand. Standard keyboard length. Very nice to press keys. Would recommend for price . Came with battery"},
{"rating": 5, "comment": "Love it! Worth the buy. Good quality. Plug and play."},
{"rating": 5, "comment": "Received everything in order. Came with batteries as well.   Delivery was fast! "},
{"rating": 5, "comment": "good! fast delivery, came in 3 days 👍 got a free gift and batteries included."},
{"rating": 5, "comment": "Very good keyboard with mouse! Look very pretty as well. Works perfectly fine and seller chat response is prompt."},
{"rating": 5, "comment": "very fast delivery. but the keys are just diff for os system. hope i can get a keyboard like logitech with the cmd key"},
{"rating": 5, "comment": "Delivery was fast, item is same as description. So far so good no problem"},
{"rating": 4, "comment": "Fast delivery and in good condition. Quite satisfied with the product."},
{"rating": 5, "comment": "fast delivery within 2 days and no regrets - really pretty keyboard! been using both keyboard and mouse for several days now, and still loving it :)) pretty good to type. had some hiccups at first but seller was very friendly and prompt in offering advice and guidance. overall a satisfied purchase!"},
{"rating": 5, "comment": "really worth it. came super fast too. has become an essential and i use it everyday. really helpful for school"},
{"rating": 5, "comment": "Nice and the packaging was also very good. The colour is also aesthetically pleasing"},
{"rating": 5, "comment": "Fast delivery. Everything is good. No damaged. Perfect. Thks for the free gift."},
{"rating": 5, "comment": "Fast delivery. Very nice. I like it. Comes with batteries for both mouse and keyboard."},
{"rating": 5, "comment": "Fast delivery and received it in good conical and batteries were provided as well"},
{"rating": 5, "comment": "Packed nicely and fast delivery! Product as described. Not too loud but nice to the touch. True of some reviews that the mouse isn’t as sensitive but nothing that a good mouse pad can’t solve. (Can view video for sound)"},
{"rating": 4, "comment": "Overall good purchase for the price- comes with mouse.\n\nThe mouse is not the silent type. So you will hear click sound. The keyboard works well. I just need to get used to the high key profile - I've been using low key for the longest time. \n\nFor the price and the functionality- great buy."},
{"rating": 5, "comment": "Both mouse and keyboard Connects will with my laptop using the USB receiver. Ordered on Saturday and received on Tuesday, definitely worth the $19.90 spent 😁"},
{"rating": 5, "comment": "Received within 2 days. Very comfortable to type on and I’m good condition"},
{"rating": 4, "comment": "Some discolouration on the mouse. Other than that its very acceptable :)"},
{"rating": 5, "comment": "Box a bit squashed but item is in good condition. Arrived in 3 days!! Very fast!\nI love the sounds and how it feels when I type on it!! And the colour is so cute!\nWatch the vid with sound for the clicky sounds!!"},
{"rating": 5, "comment": "Came well bubble wrapped altho the box was still a bit dented. Divery was faster than expected, thanka to seller who helped to send item out as early as he could. Appreciate that! The colour and touch of the keyboard is really cool! Tks for the cute key chain too!"},
{"rating": 5, "comment": "nice and affordable tried it at home yesterday and it works well"},
{"rating": 5, "comment": "Delivery was fast. Bought it for other people. Nice and smooth. Easy connection."},
{"rating": 5, "comment": "Great deal. Works well. Fast delivery. Thank you seller!!!"},
{"rating": 5, "comment": "Well recieved and looks as per photo, however unsure how to switch in and off"},
{"rating": 5, "comment": "Love it! So fun and comfortable to type. Isn’t noisy and very fast delivery"},
{"rating": 5, "comment": "Fast delivery and super nice colour! Thank you Seller!!!!"},
{"rating": 5},
{"rating": 4, "comment": "Keyboard and mouse was packed well. Delivery was fast as well with ninjavan. Both in working condition (I think). Control C / V isn’t working so I’m not sure if it’s us the keyboard."},
{"rating": 5, "comment": "Prompt Delivery, very pretty color , love it … bought for office use …………"},
{"rating": 5, "comment": "Very fast delivery. Buying together with my colleagues in office. Colours are bright and sweet. Keys function are in order. More colleagues are buying after seeing our nice keyboards."},
{"rating": 5, "comment": "its reali cute... love love love it... \nmay buy 1 more for my sis🤗"},
{"rating": 5, "comment": "Bought for work purposes for me and my bestie! Loving the colours!"},
{"rating": 5, "comment": "Speedy delivery. So far keyboard and mouse works well. Though the angle of the mouse is abit awkward for me. But still very pretty. Happy with purchase."},
{"rating": 5, "comment": "The usb connecter uses only one inside the mouse and it will activate the keyboard too. Love this new keyboard. Arrived so fast and packed nicely."},
{"rating": 5, "comment": "v easy to connect and use .. fast delivery too!"},
{"rating": 5, "comment": "Arrived just 1 day after making order on 5.5\nKeyboard is silent and keys are nice and soft\nMouse also working beautifully\nCompatible with mac for most buttons and I'm super happy with this purchase. Thanks for free gift!"},
{"rating": 5, "comment": "super prettyyyyy!! and the clicking sound not so loud so it’s very good!"},
{"rating": 5, "comment": "Performance:nice\n\nnice colour and sounds nice when typing on the keyboard. thanks"},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Nice and easily fix.\nThank you seller."},
{"rating": 5},
{"rating": 5},
{"rating": 4},
{"rating": 5},
{"rating": 5, "comment": "Nice and can use with rk keyboard"},
{"rating": 5, "comment": "Compatible with tecware phantom (and most other mech keyboards). Delivery took around two weeks."},
{"rating": 5, "comment": "Awesome"},
{"rating": 5, "comment": "great\n"},
{"rating": 1, "comment": "The quality, well there wasn’t any quality of this product. The keyboard F3 key is “sink” compare to the rest of the keys and N key is completely malfunctioning. The mouse have completely no response after plug in. And before plug in, the right click cannot press down at all."},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Delivery was fast, delivered the next day after order. One of the best keyboard mouse I ever purchased."},
{"rating": 5, "comment": "The button works great! the spacebar is little bit higher than my other keycaps"},
{"rating": 5},
{"rating": 5, "comment": "Super fast delivery"},
{"rating": 2, "comment": "Quick delivery. \nThe keyboard feels a lil less stable when typing.\nThe keyboards tends to be lag when typing. Sometimes I press a key, let say \"A\", it will lag a while then \"AAAAAAAAA\" came out after a lag.."},
{"rating": 5},
{"rating": 5},
{"rating": 3, "comment": "Keyboard button are big and backspace delete has to be done one by one."},
{"rating": 5, "comment": "Ok as per described"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 3, "comment": "Keyboard and mouse feels sturdy and solid.... but there are some noticeable slight lagging between hand and cursor movement on screen."},
{"rating": 5},
{"rating": 5, "comment": "Ordered on 12.12 and came after 1 day! Tested and it has a good touch and feel on both the mouse and keyboard. Love it."},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 4},
{"rating": 5},
{"rating": 5, "comment": "Have yet to use.  Hopefully it is good. Can feel the keys on the keyboard are soft and nice to type."},
{"rating": 5, "comment": "Fast Delivery and good quality"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Fast delivery. Good product."},
{"rating": 5},
{"rating": 5, "comment": "Good price, Average quality. Good for basic use."},
{"rating": 5, "comment": "Will buy again! Slim and fast"},
{"rating": 5, "comment": "Fast delivery. Works perfectly"},
{"rating": 5},
{"rating": 4},
{"rating": 5, "comment": "Received in good condition, working condition."},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Fast delivery, well received but yet to try. Not sure it will last long."},
{"rating": 5},
{"rating": 5},
{"rating": 4},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Fast delivery and received in good conditions. Excellent! 👍 👍"},
{"rating": 4},
{"rating": 5, "comment": "Works well. Didn’t see the small button to on for the keyboard."},
{"rating": 5, "comment": "Fast delivery and everything ok.."},
{"rating": 5, "comment": "Good product. Well packaged. Fast delivery"},
{"rating": 5, "comment": "Super fast delivery. Item looks great to start to use! Slim as expected!"},
{"rating": 1, "comment": "Poor packaging, only stick shipment sticker on top of box. Not deserve for star at all"},
{"rating": 5, "comment": "Seller is very nice to accommodate my request of sending it the next day. Item very good too."},
{"rating": 5, "comment": "Excellent! Happy with purchase. Would recommend"},
{"rating": 5, "comment": "fast delivery. comes with batteries. works well. silent keyboard"},
{"rating": 5, "comment": "Very nice. Smooth. Quiet. Highly recommended."},
{"rating": 5, "comment": "Super fast delivery which is great cos i needed it urgently. \n\nEasy set up. \n\nThink need to tweak the mouse setting. Quite difficult to highlight text. The click wont hold properly. Keeps dropping off."},
{"rating": 5, "comment": "Very good item but then my first order was lost and cannot be found got my order canceled after waiting for awhile and then had to order again too much hassle"},
{"rating": 5, "comment": "Received with thanks"},
{"rating": 5, "comment": "Fast delivery. \n x4 Batteries inside.\nPlug and play. Smooth. Sendetive. Smooth."},
{"rating": 5, "comment": "Very good. Quiet keyboard and mouse. Best product"},
{"rating": 5, "comment": "Sleek white color. Keyboard n mouse is silent. Easy to type. One usb connect to both keyboard n mouse. 👍🏼"},
{"rating": 5, "comment": "Fast delivery, ordered on Sunday received on Tuesday. Yet to try this keyboard. Read a lot of good reviews for this keyboard. Excited to try. Hmmmmmmmmmmmmmmmm…."},
{"rating": 4, "comment": "Does not work with Xiaomi TV\nTried on computer, works well\nOrdered 12.12 and received on 15.12"},
{"rating": 5, "comment": "Very fast delivery. Awesome product quality for the price range. Definitely worth it."},
{"rating": 2, "comment": "Performance:ok\n\nWanted to review after testing out a few days. Bought for staff to use in office. Was working properly a few days then suddenly cannot connect. Had restart computer and also plug other usb. Doesnt work. So after 5 days , spoilt.  Contacted live agent chat but no updates ."},
{"rating": 5, "comment": "Quick and prompt delivery. Good quality for the price. Recommended."},
{"rating": 5, "comment": "Fast delivery and item is per described. Tested and work well. Plug and play."},
{"rating": 5, "comment": "Key and mouse is quite hut the mouse button is pretty hard to press and the mouse is quite big. I still prefer my logitech silent mouse."},
{"rating": 5, "comment": "Item received in good conditions, delivery was fast, thank you."},
{"rating": 4, "comment": "The product came as mention. Very nice to used. Thank you..."},
{"rating": 5, "comment": "Item well received. Delivery took a week. Tried and working well."},
{"rating": 5, "comment": "It works yay :) delivered in abt 1 week. Very satisfied with the packaging and product. It's silent mouse and keyboard, super nice !! Highly recommend!!"},
{"rating": 5, "comment": "Fast delivery. Very happy. It's my 3rd purchase. Affordable"},
{"rating": 5, "comment": "So nice the white nice NiceNiceNiceNiceNiceNiceNiceNiceNiceNiceNiceNiceNice"},
{"rating": 5, "comment": "Ordered on 14 Feb delivered on 16 Feb in good condition. Comfortable to type, 4 AAA batteries included so you can start using immediately."},
{"rating": 5, "comment": "Great quality for the price paid. I like the feel of the keyboard. Fast delivery! Comes with batteries, straightaway can plug and play."},
{"rating": 5, "comment": "Ordered for my mum as a replacement for a Logitech one. She still prefers the Logitech but this is good enough for the price."},
{"rating": 5, "comment": "Next day received. Fast delivery. Keyboard and mouse as described. Come with 4 pcs AAA battery."},
{"rating": 5, "comment": "2nd purchase and nice to use. Delivery is fast too ..\nGood buy"},
{"rating": 5, "comment": "cheap and good. well worth the money for a cheap wireless kb and mouse set."},
{"rating": 5, "comment": "Quick delivery, seller prepared within 24hours of order. Yet to try but looks ok"},
{"rating": 5, "comment": "Quick delivery and easy set up! Comes w batteries so can use immediately. The mouse click is pretty soft, and the keyboard is not the noisy kind so good if you like a quiet environment while doing work. Overall looks really pretty and minimalistic. love!"},
{"rating": 5, "comment": "Love it so much. I just like the click sound on it when using. .."},
{"rating": 5, "comment": "Great"},
{"rating": 4, "comment": "Pros:\nVery nice design and the material is good. Colour is also nice. \n\nCons:\nThe keyboard feel is not to my liking. I prefer more mechanical typing.\nThe battery slot for mouse doesn’t open easily."},
{"rating": 5},
{"rating": 4},
{"rating": 1, "comment": "Serve the purpose but feels like poor plastic"},
{"rating": 5, "comment": "Better quality...received on time...thumbs up"},
{"rating": 5, "comment": "Received with thanks 😊 "},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Item received in good condition. Have yet to try it out"},
{"rating": 5},
{"rating": 4},
{"rating": 5},
{"rating": 5, "comment": "super fast delivery. it works very well. will buy another unit for standby :)"},
{"rating": 5, "comment": "Good deal! Bought it during flash sales"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 3},
{"rating": 5, "comment": "The product is so so . At this price still ok… sometimes when you type the keyboard the word is not straight away come out got second delay"},
{"rating": 3},
{"rating": 5, "comment": "Fast delivery..really lightweight..function as advertised.."},
{"rating": 5},
{"rating": 4, "comment": "Battery cover broken. Very brittle plastics. Hope that the keyboard itself can last. Haizzz..."},
{"rating": 5, "comment": "This is a very good value for money keyboard and mouse combo! Decent quality for it's price. The seller also left this note inside an angpow ☺️"},
{"rating": 5, "comment": "Glad to receive it on the first day of lockdown 2.0. A very basic keyboard but good enough for the temp.needs of wfh. "},
{"rating": 5, "comment": "$9.90 such price ok"},
{"rating": 5, "comment": "Delivery lead time is decent. Got a pretty good deal at 10.10. The mouse has a good grip but the keyboard didn't have indicator for cap lock or num lock."},
{"rating": 5, "comment": "Fast delivery. Material simple quality.\nQuick Plug and play setup."},
{"rating": 5, "comment": "Value For Money:best\n\nItem received. Ordered on the 23.5.22 received 25.5.22. Well packed. Yet to try... Anyway ThkQ."},
{"rating": 5, "comment": "Fast delivery, and nice to use"},
{"rating": 5, "comment": "Just received, but yet to try to link to my laptop. Hope it is useful as my current one is too small.."},
{"rating": 2, "comment": "Faulty keyboard arrows and mouse command. Can type the alphanumeric but cursor keeps going to the right nonstop. Kindly replace. Thanks"},
{"rating": 5, "comment": "Delivery was super fast. Item as per described. Slightly to mechanical keyboard. Good deal. Thanks you guys 😊"},
{"rating": 5, "comment": "Bought to use at my work bench, really like it and has soft keys. Will be easy to clean dust and whatever comes its way due to the design. Paid $9.90 during 5.5 sale, received on 8/5. Great price!"},
{"rating": 5, "comment": "Fast delivery within 2 days. Items are cheapest on Shopee and based on good reviews. Yet to test hope it works. "},
{"rating": 5, "comment": "Fast delivery and Order received in good condition. Hope it can last for some time. Thank you seller."},
{"rating": 5, "comment": "Bought during sale. For the price, can't complain."},
{"rating": 5, "comment": "Received in good condition. Fast delivery. Works well and i like it alot.  Hope it can last long enough."},
{"rating": 5, "comment": "Fast delivery. Items in good condition. Work perfectly well. "},
{"rating": 5, "comment": "Well received and fast delivery. Very basic wireless keyboard with mouse. Bought this as a spare as it is inexpensive."},
{"rating": 5, "comment": "Good price. Feels nice. Will probably buy more in the next flash sale"},
{"rating": 4, "comment": "Received in good condition. Usb very tight so hv push in and take out really carefully. The sound of the keyboard is typically like the old school typist. Good enough for those who just want a simple keyboard n mouse for work from home, could be better though."},
{"rating": 5, "comment": "This is a repeat order for another two of my office buddies! After seeing me using it. Delivery is within 2 days. Tks seller and delivery boys."},
{"rating": 5, "comment": "Value For Money:yes\nPerformance:not bad\nBest Feature(s):light weight\n\nReceived in good condition and fast delivery.. feels like toy and very light in weight.. if there's rubber on the bottom of the keyboard will be good.. to stop the keyboard from moving.."},
{"rating": 5},
{"rating": 5},
{"rating": 4, "comment": "Delivery was quick considering 12.12 traffic. \nQuite nice to type on. Delay on keyboard and mouse is verrrry slight but noticeable. Overall acceptable for the price point and not an issue for work. Can see it being a problem if ppl are expecting to use it for gaming."},
{"rating": 5, "comment": "Worth for money 9.90 only.. maybe more than this price need consider . Key board ok."},
{"rating": 4},
{"rating": 5},
{"rating": 5, "comment": "Delivery was fast. Keyboard is slim. Item was not packed and box was dented at the side."},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Sweet wireless device. Comfortable and awesome features."},
{"rating": 5, "comment": "Good"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 4},
{"rating": 5},
{"rating": 5, "comment": "Works well. Easy to set up. Quick delivery. 4 AAA batteries provided."},
{"rating": 5},
{"rating": 5},
{"rating": 4, "comment": "Keyboard was faulty when I used it for the first time. Keys unable to typed properly. Contacted the seller and managed to get it change."},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Fast delivery!"},
{"rating": 5},
{"rating": 5, "comment": "Fast delivery, easy to connect. Thanks"},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "it is the smoothest keyboard and mouse i’ve used for the longest time, it’s light and quiet, just plug and use… simple!"},
{"rating": 5, "comment": "Fast delivery in just a few days. Both worked well with my smart tv. Hopefully it’ll last. Thanks seller."},
{"rating": 5, "comment": "fast delivery\nhope it work"},
{"rating": 5, "comment": "Delivery is fast"},
{"rating": 5, "comment": "Item received packed well , haven try yet ... price is cheap"},
{"rating": 5, "comment": "Next business day delivery as advertised.\nAmazingly silent keyboard and mouse."},
{"rating": 5, "comment": "Ordered received, soft keyboard,"},
{"rating": 3, "comment": "Keyboard does not have extra protection, bubble wrap, waterproof packaging etc. It was just delivered in the keyboard box as shown in picture. Parcel was delivered on a rainy day and the box was drenched. Luckily both keyboard and mouse are working fine and keyboard is very nice to type."},
{"rating": 5, "comment": "Very good quality keyboard and mouse. And it's SILENT!!!"},
{"rating": 1, "comment": "Fast delivery however my keyboard is not working and seller refuses an exchange till now"},
{"rating": 5, "comment": "Good buy. Comes with batteries and keys are soft."},
{"rating": 5},
{"rating": 5, "comment": "Took 2 days to deliver. Overall it works"},
{"rating": 5, "comment": "Brought these for colleagues.  Very fast delivery. Very good."},
{"rating": 5, "comment": "Speedy delivery…. Like the keyboard in white colour… but the mouse is not smooth as Logitech… the roller is not silent when roll up…"},
{"rating": 5, "comment": "Fast delivery in 2 days received in good condition. Keyboard is good quality and mouse is average. Overall great flash deal. Thanks!"},
{"rating": 5, "comment": "Key travel while typing is super convinient and smooth. Doesn't project loud sounds while typing just a tuck sound. Able to use for both my MacBook and windows laptop! One USB driver to connect both the keyboard and mouse wireless-ly. Worth the buy at an affordable price!👍🏼\n"},
{"rating": 5, "comment": "Item received in good condition and nice use Gd quality......"},
{"rating": 5, "comment": "Very fast delivery.  Correct order delivered."},
{"rating": 5, "comment": "Had difficulty connecting to my MacBook initially but got busy so went to do other stuff. Came back to try again in the evening and it connected. Mouse is a little bulky."},
{"rating": 5, "comment": "Very fast delivery .ordered yesterday night, received today afternoon.  Quality is good .Will recommend this ."},
{"rating": 5, "comment": "Item received in good packaging and condition delivery 🚚 is good 👍🏼 thanks"},
{"rating": 4, "comment": "Item received in good condition.Fast delivery.But I cannot use screen brightness in volume in laptop.Other ok."},
{"rating": 5, "comment": "Works wonderfully and it's a must have if u don't like a messy table top."},
{"rating": 5, "comment": "The quality is good, value for money"},
{"rating": 5, "comment": "Deliery took less than 2 days. Item looks good yet to try hope all is well"},
{"rating": 5, "comment": "Yet to try as meant for office laptop. Hopefully it works well, the cover for the 🐁 is difficult to remove n got stuck, hope won't affect the productivity."},
{"rating": 5, "comment": "Very very good I use it with my iMac and it works except must get use to the audio up and down button must press function key."},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Good value\n"},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "super fast delivery"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 3, "comment": "usb area abit unstable, keyboard will randomly disconnect despite being untouched"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Received item in good condition. Not bad.."},
{"rating": 5, "comment": "Item is as per description. Reliable seller. Fast delivery."},
{"rating": 5, "comment": "Delivery was fast. Item was good for the price. I like it and would recommend for those need simple keyboard."},
{"rating": 5, "comment": "not a gamer but needed an illuminated keyboard. turns out nice. all keys responsive."},
{"rating": 5, "comment": "Received within 2 days of purchase! Item is well packed!\nThere are only 2 types of light effect instead of the stated 9 backlight effect. \nFor the cost I think the material is good , keys are crunchy but not hard to press, love it! \nOverall really well worth the money I hope it will last! "},
{"rating": 5, "comment": "It's actually a good quality mechanical keyboard"},
{"rating": 5, "comment": "Fast delivery, got smell when newly open the wrap but after that the smell went off. Hope can last long."},
{"rating": 5, "comment": "Delivery is ok. Tested out the keyboard and it worked well. Comfortable to use. Recommended!"},
{"rating": 5, "comment": "works well. def rexommend. came within 3 days of purchase. 👍🏽👍🏽"},
{"rating": 5, "comment": "All keys work well and its ok for the price. The box that it was delivered in was just cling wrapped though."},
{"rating": 5, "comment": "super duper fast delivery \narrived in like 2-3 days \nhave yet to try it out hopefully works well"},
{"rating": 5, "comment": "Super fast delivery from this seller. Within 2 working days and the item is here!!! Superb. Gonna get my hands on it. "},
{"rating": 3, "comment": "Quite easy to type the wrong key and not as quiet as advertised, plus there's no grip on the bottom to keep it from sliding around on smooth surfaces. Otherwise it gets the job done"},
{"rating": 5, "comment": "Item was nicely packed and fast delivery too. Seems to be working good. My nephew loves it."},
{"rating": 5, "comment": "Nicereeeeeeeeeeee and love it will buy again thsnk thank you so much ee"},
{"rating": 5, "comment": "The item came in good condition but it was what i had expected. Really like the look and the sound of the keys :)"},
{"rating": 5},
{"rating": 5},
{"rating": 3},
{"rating": 5, "comment": "keyboard is not really silent and is light but will do cheap keyboard cannot expect too much!"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Great quality, true to size, nice design, really cant go wrong with this"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 4},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "good quality and worth it for its price, very nice would buy again"},
{"rating": 5, "comment": "Bought it on the 22 Feb. Arrived within 9 days including the weekends. Overall, quality is decent and feels goods but it has a surprisingly good rubber anti slip. 👍"},
{"rating": 5},
{"rating": 5, "comment": "Quality of the mouse pad is good! Worth the buy! Will definitely buy again!"},
{"rating": 5, "comment": "Quality good, design is nice only thing it took quite long to come and I don’t like to wait. I even forgotten about it"},
{"rating": 5, "comment": "Lovinggggggg this mat so far! Should have gotten a slightly bigger one. But all's good."},
{"rating": 4},
{"rating": 5},
{"rating": 5, "comment": "Quality is good. The selection of sizes are good too.  Design print is nice too."},
{"rating": 5},
{"rating": 5, "comment": "Item took a while due to covid situation from place of delivery. Quality is good, however the smell is quite smell. Overall its good and deserving of 5 stars."},
{"rating": 5},
{"rating": 4, "comment": "Keyboard well received in good working condition however is not what I have expected. Keys sensitivity are so so only but serve it's purpose for normal use but don't think is good for gaming."},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "item receive"},
{"rating": 5},
{"rating": 5},
{"rating": 3},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Value For Money:is decent"},
{"rating": 5},
{"rating": 5, "comment": "Nice, my son love it"},
{"rating": 5, "comment": "Order well received!\nLooks Good!!!!!!"},
{"rating": 5, "comment": "Took less than 3 days to arrive. Arrived in good condition and looks so cool :)"},
{"rating": 3, "comment": "Not a mechanical keyboard. Only one type of light, either on or off. Doesn’t have the mechanical sound for the keyboard. Failed big time."},
{"rating": 5, "comment": "Package was nicely wrapped when delivered. Though the brown box was damaged, the keyword is  in working condition and the lights can be on n off"},
{"rating": 5, "comment": "Items came in good condition and seller was helpful with my questions as well :)"},
{"rating": 5, "comment": "Happy with purchase!"},
{"rating": 2},
{"rating": 5, "comment": "fast delivery. typing this review with the keyboard itself and it feels nice to type. considering the price, it is worth paying for. it is also packed very well"},
{"rating": 5},
{"rating": 5, "comment": "Surprisingly very good keyboard quality for the price"},
{"rating": 5},
{"rating": 5, "comment": "Performance:soft feel\nBest Feature(s):normal\nValue For Money:you pay for what you get\n\nDelivery was well wrapped but don’t think this product can last long"},
{"rating": 5},
{"rating": 5},
{"rating": 4},
{"rating": 5, "comment": "item was amazingly delivered although packaging was a bit damaged but the functions were amazing"},
{"rating": 5, "comment": "Very fast delivery and keyboard is perfect!!\nIts not the most solid based keyboard but for this price, it is very well built. The mechanical switch is great😻😻 make typing easy"},
{"rating": 5},
{"rating": 5, "comment": "Very nice and delivery was fast .. will support again."},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Keyboard function great and the colour is nice!\nFast delivery too. Thank you seller"},
{"rating": 5},
{"rating": 5, "comment": "Shipping was on point, complete delivery in 2 days. The product is great works well for someone who wants a cheeper alternative to a nice keyboard."},
{"rating": 5, "comment": "Fastest delivery, received the next day. Product was of good quality"},
{"rating": 5, "comment": "I love it! From the clicking to the colour display settings~ hehehe thank you! And thank you for the rabbit sticky note🤭"},
{"rating": 5, "comment": "Very fast delivery. Consider as a good mechanical keyboard for the price i paid."},
{"rating": 5, "comment": "Awesome clicky compact keyboard!!! For the price, super worth it. No complains and highly recommended. Ordered 21/4 10am and received 22/4 4pm!!"},
{"rating": 5, "comment": "Nice clicky sound and very compact 👍"},
{"rating": 5, "comment": "It’s goood! Love the sound , works fine . Hopefully will last me quite a long time"},
{"rating": 5, "comment": "Very good quality. Soft. Recommended."},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Good item, fast delivery. Will order again if needed :)"},
{"rating": 5},
{"rating": 4},
{"rating": 5, "comment": "Items received in good order. Case is soft and still fit my keyboard together with the transparent cover. Overall satisfied purchase."},
{"rating": 5, "comment": "Received in good condition"},
{"rating": 5},
{"rating": 5, "comment": "Really happy with my purchase"},
{"rating": 5},
{"rating": 5, "comment": "The item has that new-fake-leather smell but after airing it out, it smells ok. Couldn't squeeze in the keyboard when it has the plastic cover on."},
{"rating": 3},
{"rating": 5},
{"rating": 4},
{"rating": 5},
{"rating": 4},
{"rating": 5},
{"rating": 5, "comment": "fast delivery and very nice!"},
{"rating": 5},
{"rating": 5, "comment": "Came quickly and well packaged, appreciate the packaging!"},
{"rating": 5, "comment": "Item took 17 days to reach though I dont think its the seller's fault. \nThe item was squished up in a ziplock bag, but it worked fine on the keyboard."},
{"rating": 3},
{"rating": 5, "comment": "received as described and in good condition"},
{"rating": 5, "comment": "looks and feels good, has a bit of a smell but otherwise alright for the price"},
{"rating": 5, "comment": "Cover is super pretty and fits well!! Keys are still nice to press even after covered"},
{"rating": 5, "comment": "came as described, delivery time was okay too. perfect fit for the keyboard."},
{"rating": 4, "comment": "Items were received in good condition! Colour of the keyboard bag was similar to pictures, that was good. The brush's bristles were hard though, seems hard to brush, or may be too harsh for surfaces."},
{"rating": 5, "comment": "👍👍👍👍👍"},
{"rating": 5, "comment": "Nice colour. Nice quality. Recommended!!"},
{"rating": 5, "comment": "Received in good condition. Fast delivery and happy with the purchase."},
{"rating": 5, "comment": "perfect fit and super pretty :) highly rec!"},
{"rating": 5, "comment": "The keyboard cover is quite a good fit so it does not come off too easily. Case fits keyboard nicely, stitching is not bad"},
{"rating": 5},
{"rating": 5, "comment": "fits nicely thanks seller!"},
{"rating": 5, "comment": "Good quality and can fit the keyboard very well. Thanks seller."},
{"rating": 5, "comment": "Feels like leather but doesn't smell like it 🤣 But I like the Dusty Pink color plus good workmanship. It's too long for my present keyboard which is only 8 inches."},
{"rating": 5, "comment": "The bag feels nice, fits the keyboard great. However I tried to put in the keyboard plastic cover, does not fit in well together."},
{"rating": 5, "comment": "Very nice ! fits my keyboard very snug 😊 it came very well packaged and it came very quickly !"},
{"rating": 5, "comment": "Quality isn’t too bad. The bristles on it are slightly rough but other than that, it’s alright!"},
{"rating": 5, "comment": "Product as described, material feels good! Got the pink shade to match my pink keyboard 🤩 the fit is pretty snug will require abit of effort to fit it all in but hopefully will be smoother afterwards sometime"},
{"rating": 4, "comment": "Wireless mouse don't really detect movement smoothly, sometimes it's fast and sometimes it's slow."},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Received after delivery delay. Courier did inforned. Do note that the flap does not fully cover the 2 corners"},
{"rating": 5, "comment": "It’s good!"},
{"rating": 5, "comment": "Great deal and fast delivery ~ "},
{"rating": 5, "comment": "Product works as advertised."},
{"rating": 5, "comment": "Compact and easy to use. Good!"},
{"rating": 5},
{"rating": 5, "comment": "Good product, fast delivery."},
{"rating": 1, "comment": "Mouse always disconnected, faulty items.\nImmediately asked for replacement from seller, they just pushed the responsibility to me and asked me to claim warranty in stead. Be careful when buying from this seller. "},
{"rating": 5},
{"rating": 5, "comment": "Good products. Get at good price"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Very satisfied! 😁 "},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Product arrived promptly and as described.  Product works just fine and easy plug and play setup "},
{"rating": 5, "comment": "Fast delivery. The items work fine and easily connected. The design of the keyboard is very compact and saves space. Overall is a good buy."},
{"rating": 5, "comment": "Nice to use. Good to see. "},
{"rating": 5, "comment": "Item delivery fast then expectation 👍👍"},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Compact keyboard, may be a bit hard to use for those who are comfortable with larger keyboards but overall fully satisfied with the purchase. Light and convenient to bring around, and mouse fits well in my hand. "},
{"rating": 5, "comment": "Fast delivery, goods received in perfect conditions. Is compact & looks cute, my little girl love it so much. 👍"},
{"rating": 5},
{"rating": 5, "comment": "Fast delivery, product received in good condition"},
{"rating": 5, "comment": "Good. Very compact, fast delivery"},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Very fast  in delivering "},
{"rating": 5},
{"rating": 5},
{"rating": 1},
{"rating": 5, "comment": "Good"},
{"rating": 5},
{"rating": 5},
{"rating": 3, "comment": "My previous keyboard was also the same model, but somehow seemed more sturdy. This current one i received tends to bend a little in the middle when I type, which does not make for a good typing experience. "},
{"rating": 5, "comment": "Instant use. Like the keyboard, not the bulky type but just right size for my fingers. "},
{"rating": 5},
{"rating": 4, "comment": "Quick delivery (not free). Item is good but usb receiver is rather bulky. "},
{"rating": 5},
{"rating": 4, "comment": "Product received as promised but I wished the delivery man could have contacted me if No one was at the door. They just threw the box in between my gate and main door 😕"},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Fast delivery 👍👍👍"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Compact and nice."},
{"rating": 5},
{"rating": 5, "comment": "All ok"},
{"rating": 5, "comment": "Cheaper than usual"},
{"rating": 5},
{"rating": 5, "comment": "Good product as usual, works as intended"},
{"rating": 5, "comment": "Repeat buying. Value for money during sale "},
{"rating": 5, "comment": "Item is well received. I love this petite keyboard with num pad."},
{"rating": 5, "comment": "Very fast delivery, good service. Tested it is working fine. "},
{"rating": 5, "comment": "Received in good condition. Gotten it from a flash deal. No complaints. Yet to use it. hopefully it works."},
{"rating": 5, "comment": "Arrives in 3 days amidst the covid circuit breaker time. Keyboard and mouse is excellent. Worth the money"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "well the brand says it all"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 4, "comment": "mouse is quite heavy cos its 2 AA batteries. but value for money."},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "second time buying this keyboard. one for office one for home!"},
{"rating": 4},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "nice！！！"},
{"rating": 5},
{"rating": 5, "comment": "Fast delivery and working well!"},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Eight pairs of Brick heads are pitted against each other in a quest to impress with their creativity, design and flair, driven by their unparalleled passion for the possibilities that will"},
{"rating": 5, "comment": "great so far n afforable, will purchase again if needed in future"},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Great quality"},
{"rating": 5, "comment": "Receiced with good condinltion"},
{"rating": 5, "comment": "Compact keyboard. Fast Delivery."},
{"rating": 5, "comment": "👍🏻👍🏻 cheap & good!"},
{"rating": 5, "comment": "It works straight out of the box (after inserting batteries,  of course)!"},
{"rating": 5, "comment": "Products well received. Tested out and working well. Very fast delivery👍. Place order on 5 May and alrdy received on 7 May. "},
{"rating": 5, "comment": "Quick Delivery, this is a small compact keyboard, so take note if you intend to buy this.\nComes with battery for both kb and mouse. So far so good."},
{"rating": 5, "comment": "Recieved in good condition. Tried n working well. Batties are included. Delivery is fast"},
{"rating": 5, "comment": "Item received in good condition.\nFast delivery\nWill come back again in future"},
{"rating": 5, "comment": "Fast delivery"},
{"rating": 4, "comment": "Bought during double 11 sales @20sgd... Considered fast delivery on 16/11. Easy to setup and keyboard is silent,  but mouse is quite heavy with 2x AA batteries.. So i give 4 stars. "},
{"rating": 5, "comment": "Fast delivery and working fine. Just that the USB is a Longer than expected. "},
{"rating": 5, "comment": "Space-saving minimalistic keyboard-mouse combo. Does its job. 👍🏻"},
{"rating": 5, "comment": "bought on 9.9, item delivered on 11.9! v fast delivery. but take note there is no specific time range given for the delivery so be prepared to wait to receive or let them leave the parcel at the door. came wrapped in plastic bag without bubble protection. mouse box was slightly dented."},
{"rating": 5, "comment": "Redeive the order in good condition. Thanks. Recommneded."},
{"rating": 5, "comment": "Genuine product,fast delivery."},
{"rating": 5, "comment": "Next day delivery! Tested and works well. Compact size is good, comfortable for typing "},
{"rating": 4, "comment": "Speedy delivery, 2nd purchased."},
{"rating": 5, "comment": "Trusted seller. Fast delivery 3 days. Value for money. Thanks"},
{"rating": 5, "comment": "Slim keyboard 👍🏻"},
{"rating": 5, "comment": "received safely packaged in bubble wrap. speedy delivery too. "},
{"rating": 5, "comment": "received safely packaged in bubble wrap. speedy delivery too. "},
{"rating": 5, "comment": "fast delivery and items are all in good condition! decent mouse and keyboard for the price "},
{"rating": 5, "comment": "Received within 3 days."},
{"rating": 5, "comment": "Received fast and in good working condition. Got it at a good deal price on 6.6. (Received much earlier but waiting for other items to test together) "},
{"rating": 5, "comment": "Very reasonable price and timely delivery highly recommended seller "},
{"rating": 5, "comment": "The package came in really fast thank you guys. Received it well packaged."},
{"rating": 5, "comment": "Fast delivery. Received in good condition. Good quality product. Hasle free usage. Thank you."},
{"rating": 5, "comment": "Ordered on tuesday night and received it on thursday evening. Surprised that the delivery was so fast even though it's NYE. anyway, very satisfied with the purchase!"},
{"rating": 5, "comment": "Purchased during flashdeal. Items received within a week. Quite good and no complains for the price paid. Recommended!"},
{"rating": 5, "comment": "2nd time ordering, fast delivery, good price for this set!"},
{"rating": 5, "comment": "Delivery is fast in this covid period.  Was doubly wrapped in plastic.  Keyboard appears bit small but the item looks gd! "},
{"rating": 5, "comment": "Got a shock receiving it in such a big package! Item received Super fast especially during this MCO period. Easy to use, battery provided. Super well packed. Thank u seller! "},
{"rating": 5, "comment": "Received in good condition"},
{"rating": 5, "comment": "Item received as ordered, keyboard is compact and both mouse and keyboard were very easily set up."},
{"rating": 5, "comment": "Fast delivery. Thanks seller."},
{"rating": 5, "comment": "Arrived later than expected. Haven’t tried it yet. Felt a bit plasticy"},
{"rating": 5, "comment": "Perfect! Super fast delivery. Order on friday late noon, delivered on sun noon. "},
{"rating": 5, "comment": "Item review: Was deciding between this model and the MK270. Glad I went with this model as the size is perfect for me. I like the alphabets to be aroynd the middle of my wrist rest. Box comes sealed. \n\nSeller review: Seller is super responsive on shopee chat and delivery was within 5 calendar days."},
{"rating": 1, "comment": "fast delivery but there is a problem with the button.i can't printscreen which my job require alot of saving of research and normally I will printscreen all the info.image and price list for submission.and seller mentioned no exchange and with giving me voucher so means I have to buy another 1?"},
{"rating": 5, "comment": "Ok. Fast delivery"},
{"rating": 5, "comment": "Order received as advertised. Box was dented but items were ok. Came with batteries.. set up and items work well. \n"},
{"rating": 5, "comment": "Fast delivery with good condition. I am surprised that they provide batteries in it, so sweet, thank you reseller :)"},
{"rating": 5, "comment": "Fast delivery.. thx to the courier service.. \nNicely packed.. thx to the picker and packer.."},
{"rating": 5, "comment": "Like the smaller size and the key clicks are excellent for typing."},
{"rating": 5, "comment": "fast delivery. silent keyboard. but no place in the mouse to keep the USB"},
{"rating": 5, "comment": "Lost my dongle hence had to buy the whole thing again. Received item in good condition."},
{"rating": 5, "comment": "Received in good condition"},
{"rating": 5, "comment": "Much cheaper than other options for a reliable brand. However dongle is large and cannot be kept in the mouse like most models. You get what you pay for. Quality is usable so no regrets."},
{"rating": 5, "comment": "Slimmer and plan to use in office. Bought during flash sale."},
{"rating": 3, "comment": "Repeat purchase. Fast delivery, good price. Didn't open to test, purchase for colleagues.\nColleague opened and found defect in one of the mouse. See pic.  Have contacted seller for exchange on 23 May, but no response yet."},
{"rating": 5, "comment": "This is my second order, really enjoy the product "},
{"rating": 5, "comment": "Compact, nice to type on and genuine Logitech product. Mouse is a bit heavy with 2 AA batteries inside, but otherwise alright."},
{"rating": 5, "comment": "Great product and nice to use"},
{"rating": 5, "comment": "very fast delivery receive it the next working day  item nicely packed"},
{"rating": 5, "comment": "Good buy at 19.90 with 10% cash back. Come with batteries. "},
{"rating": 5, "comment": "Delivery took only 2 days. Both keyboard and mouse come with batteries. Tested and it work fine. Installation is quick and simple. "},
{"rating": 5, "comment": "Nice and sleek design. Order came crazy fast - in just 2 days. Highly recommend."},
{"rating": 5, "comment": "Parcel is very fast delivery, place order on Saturday and received it on Monday. Parcel is received in good condition. Good quality product and value to buy."},
{"rating": 5, "comment": "I loveeee it!! But the mouse is a bit heavy after the two batteries. But I still love it la"},
{"rating": 5, "comment": "Fast delivery. 2 days from order to delivery.... Very good..... Will buy again "},
{"rating": 5, "comment": "Items came very quickly and works well!! Good for the price! "},
{"rating": 5, "comment": "Well packed, like that the width is shorter than other similar keyboard such that it doesn't occupy too much space. Good buy good price."},
{"rating": 5, "comment": "Bought this during flash sale. The delivery was really fast. No difficulty to use. Battery provided inside the box. "},
{"rating": 5, "comment": "Item was delivered quickly and in excellent condition...."},
{"rating": 5, "comment": "Happy with the product. The keyboard is compact so it takes up less space. Mouse is good for man palm size."},
{"rating": 5, "comment": "The mouse has smooth movement and the build of the keyboard is perfect."},
{"rating": 4, "comment": "Small size.\n\nVery fast delivery too.\n\nItem comes with minimal padding though. "},
{"rating": 5, "comment": "Awesome!\n🤩🤩🤩🤩"},
{"rating": 5, "comment": "Delivery lead time is around 2days. Great deal during time sale. Easy to use and convenient."},
{"rating": 5, "comment": "Good buy"},
{"rating": 5, "comment": "Item received in good condition, will purchase again in the future!"},
{"rating": 5, "comment": "Ordered this as Christmas present for my friend…hope it is useful and easy to use…\nDelivery was fast…thanks"},
{"rating": 5, "comment": "fast delivery received within 3 days of ordering ...all in working condition gd"},
{"rating": 5, "comment": "Quality merchandise from Logitech. Seriously don’t waste your money buying from other brands that keys don’t pop back up after typing. For comparison a normal laptop keyboard is 28cm, this version it’s 26cm. So you down arrows might need some getting used to. No issues with mouse or Bluetooth. 💯"},
{"rating": 5, "comment": "Delivery was fast. 👍"},
{"rating": 5, "comment": "Keyboard and mouse well received. Very smooth keys to type on. Very happy and satisfied with my purchase. Got a good deal during 11.11 sale!"},
{"rating": 5, "comment": "Happy with the purchase. Received in good condition. Thank you."},
{"rating": 5, "comment": "would have gone for the later version but using this for work and i have used it before. it’s small and compact. easy or no setup required. just put in the batteries and connect the ubs to the pc. and you are set. buttons are a bit smaller but you will get used to it. it is very good for the price."},
{"rating": 5, "comment": "Great"},
{"rating": 5, "comment": "Looks good and delivery was so quick!!! Hope it works well"},
{"rating": 1, "comment": "I feel that the mouse is a bit heavy and bulky. Keyboard seems okay, easy to connect to my laptop\n\nEDIT: \nSome keys are not working and i am told by both Logitech customer service in shopee and their website to approach Kaira Technologies Pte Ltd and probably require to go down to claim warranty."},
{"rating": 5, "comment": "Order received in good condition. So happy with my purchase. Will recommend. 👍👍👍👍"},
{"rating": 5, "comment": "Goooddd.. Super slim an batteries included too"},
{"rating": 4, "comment": "The lettering is stick on so very easy to scratch or rub off just fyi."},
{"rating": 5, "comment": "Love the colour"},
{"rating": 5},
{"rating": 5, "comment": "keycaps look exactly like the picture and they are very smooth. no defects found upon delivery. highly recommend."},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "well packaged and the quality of the keycaps is rlly good :)"},
{"rating": 5},
{"rating": 5, "comment": "Good"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Received in good condition!"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Product received in near perfect condition, except I received 2 letter I's"},
{"rating": 5, "comment": "Took awhile to come even though I paid for express shipping however it came before Christmas so alls good. I gave it away so I don’t have a photo however I took a look and it looks like the picture👍"},
{"rating": 5},
{"rating": 5, "comment": "Slapped it on my keychron k2. Looks 🔥"},
{"rating": 5, "comment": "using a rk61 keeb and it looks rly cute! do take note however i think these are not authentic because the real ones (if u search on banggood) are more expensive and there are a few keycaps that are supposed to be of a cream/yellow colour and the jap characters are supposed to be greyish colour!"},
{"rating": 5},
{"rating": 4, "comment": "I have received this order. Looks okay. Will set it up and test it out."},
{"rating": 5, "comment": "very nice! quite fast delivery too!"},
{"rating": 5, "comment": "Rlly great purchase! The only shame is that my arrow keys have a weird gap as it is not the normal square keys :("},
{"rating": 5, "comment": "nice keycap"},
{"rating": 5, "comment": "Rcecived in good condition.\ngood packaging ,come in box +bubble wrap.quality is pretty  good .\nl love the keycaps !\nThanks .."},
{"rating": 5, "comment": "Colour is v pretty, delivery quite fast too i think came within a wk or so of ordering. Some dust and dirt under the keycaps but still in good condition! Good buy"},
{"rating": 5, "comment": "solid buy, super cheap and very cute keycaps. recommended!"},
{"rating": 5, "comment": "Received in good condition, thanks"},
{"rating": 5, "comment": "Received in good order. Son very happy with key caps. Item is as pictured. Good 👍"},
{"rating": 5},
{"rating": 5, "comment": "very good quality, and came relatively quickly (~2 weeks)."},
{"rating": 5, "comment": "Nice will recommend others to buy too. Delivery took around 2 weeks"},
{"rating": 5, "comment": "Keycaps looks very aestheticly pleasing."},
{"rating": 5, "comment": "the colours are very vibrant and also good quality. some key caps are a little dirty ."},
{"rating": 5, "comment": "great quality keycaps , they are quite thick too , and produce great sounds with my tangerine switches , worth the price to be honest !!"},
{"rating": 5, "comment": "Keycaps came bubble wrapped in small box which takes up lesser space :) can’t wait to use it!"},
{"rating": 5, "comment": "seller was super responsive to my questions , and delivery took abt 5 days to arrive"},
{"rating": 5, "comment": "delivery was fast and quality of keycaps is good !"},
{"rating": 5, "comment": "The key caps feels ok. I replace it on a supersonic keyboard and the angle was a bit weird. Otherwise I’m quite happy w my purchase."},
{"rating": 5, "comment": "Good quality and good value for the price. Feels durable and smooth."},
{"rating": 5, "comment": "Highly recommend! Good pricing and fast delivery! Will buy again if need be! Thank you! Well packaged and package not damaged!"},
{"rating": 5, "comment": "Have not assembled it yet, but they’re looking cute!"},
{"rating": 5, "comment": "Very happy with the purchase :)"},
{"rating": 5, "comment": "Just arrived. Everything looks alright and good. Using it now"},
{"rating": 5},
{"rating": 5, "comment": "已插上笔记本电脑试用，手感很不错。\n物流快。"},
{"rating": 5, "comment": "Performance:very good\nBest Feature(s):very good\nValue For Money:worth it\n\nReceived in good condition.  Works well. No problem. 👍😀"},
{"rating": 5, "comment": "Good quality and fast delivery"},
{"rating": 5, "comment": "Performance:Very good\nBest Feature(s):Pretty\nValue For Money:Yes, very worth, it feels and looks great\n\nFast delivery and looks clean. Love it Thanku"},
{"rating": 5, "comment": "Works well with the laptop..."},
{"rating": 3, "comment": "not nad"},
{"rating": 5},
{"rating": 5, "comment": "Delivery was fast and packing was nicely done up\nKeyboard very smooth and soft to key\nWorth buying , will buy again"},
{"rating": 5, "comment": "Keyboard came quickly.\nIn good condition other than slightly dirty at the wire."},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Good item. Working as expected"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Received item in good condition but not yet try out"},
{"rating": 4},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Great"},
{"rating": 5, "comment": "Seems to be working fine. Worth it for 9.9"},
{"rating": 5, "comment": "Item delivered very fast. Item working as advertised and better than expected. Best value for money. Will definitely order again if I need another! :)"},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "The L key is a little loose but other than that, all’s good!"},
{"rating": 5, "comment": "Key works as expected. \nVery quiet. \nPackaging was nicely intact."},
{"rating": 5, "comment": "Package well received…. The quality is just average and is expected base on the price range…. Overall is a good buy 👍"},
{"rating": 5, "comment": "Nice design, soft and silent keycaps, 👍🏻"},
{"rating": 5, "comment": "good i like the sound it makes when i type lol would recommend to buy"},
{"rating": 5, "comment": "Keyboard came well packaged and the keys feels very smooth and soft to type. The additional side button functions are really cool too"},
{"rating": 5, "comment": "Alcatroz Xplorer M550 Multimedia USB Wired Keyboard\nGood condition and thanks for the seller 👍 🙏 😀 🙌 😊 🙂"},
{"rating": 5, "comment": "Ordered on 15/12 and arrived today (18/12)\nFast delivery, item as described and I like how silent it is. Thank you :))"},
{"rating": 5, "comment": "Bought two sets for gaming use. Value buy. The keys are soft touch. Gotta get use to it."},
{"rating": 5, "comment": "Just received it, delivery was fast. The keypad sound is quite minimal, perfect for sneaky late night computer activity 🌝"},
{"rating": 5, "comment": "It’s pretty good for its price. Have used it for about a month and so far so good, but the keys might be starting to not be so good, sometimes when i hold on a key for long, it stops and i have to press the key again."},
{"rating": 5, "comment": "Worth the price. Smooth keys. Multimedia buttons are functioning well. Came with free mask (worth $9.90 on website). Would purchase from seller again."},
{"rating": 3, "comment": "Fast delivery and looks pretty good, but tho can connect to laptop through Bluetooth, still need to plug in the USB."},
{"rating": 5, "comment": "Items well packed and is in good condition. Very pretty too! Comes with batteries"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Received my items within a few days. Satisfied with my item! totally love the pastel colour keyboard & mouse."},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Love it! Super pretty and delivery is within 2 days! Worth the purchase"},
{"rating": 5},
{"rating": 5, "comment": "Received in good condition and working fine. Totally love it. Thanks"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "The pink is pretttyyyy"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Very fast delivery ❤️"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "收到货了，在两天内就能拿到货…这个颜色很美很喜欢😘……………………………………………………………………………………"},
{"rating": 5, "comment": "Received with thanks 😊"},
{"rating": 4, "comment": "Delivery took a while price wise ok la fr the quality"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "i love this kind of retro thing"},
{"rating": 5},
{"rating": 4, "comment": "Bought this the second time. The new one feels different. The letter “B” is very soft and sometimes despite pressing the letter doesn’t appear & the entire keyboard is shaky.\n\nBut the seller service recovery is amazing. Thank you so much for the prompt reply and for resolving the issue."},
{"rating": 5, "comment": "Functional. Aesthetic and quite fast delivery! Compatible with ios/apple system which is a plus for me."},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Very responsible and responsive seller. I've received a faulty item. The seller replied promptly to all messages even on weekends and sent me a replacement very quickly."},
{"rating": 5},
{"rating": 5, "comment": "Received the item and look good haven’t try yet\nSo hopefully everything ok"},
{"rating": 5, "comment": "Wow, fast delivery... It work well, love it.. Like the colour, and the sound too, haha.. Thanks seller."},
{"rating": 5, "comment": "i love the keyboard! it has the clicky noise and its the most affordable amongst all the other sellers out there. love the fact that the batteries are also provided :) would recommend 10/10. "},
{"rating": 5, "comment": "Delivery was fast and this keyboard & mouse need a connector so can pluck in the USB! Overall, very satisfied with my purchase! Really love the sound of the keyboard and the clicking of the mouse"},
{"rating": 5, "comment": "Pretty Color for the keyboard !! Love it as I bought for my mum ❤️"},
{"rating": 5, "comment": "Item received in good condition. Great keyboard and nice color"},
{"rating": 5, "comment": "Very pretty keyboard! Love the matching red wireless mouse too. Super fast delivery time! Ordered on 25 May late night and received today, 28 May. Just in time for my WFH. Thank you."},
{"rating": 5, "comment": "Love it so much! Fast delivery. Item as described and value for money! Love it"},
{"rating": 5, "comment": "10/10"},
{"rating": 5, "comment": "There is no word to describe how awesome the service I experienced.  Seller was so prompt, sincere & patient to resolve my prob. Keyboards r beautiful & soft. Delivery was prompt too. 1 of the best seller I ever met. Thank you for everything and thanks for the trust. Rate 10/5!"},
{"rating": 5, "comment": "Love the item so much."},
{"rating": 5, "comment": "the keyboard is cute and can work properly on my computer 👍 would recc to my friends/family 😊"},
{"rating": 5, "comment": "Item was well packed in box then bubble wrapped. Ordered Thu night and item arrived next Mon afternoon. Alphabet buttons are slightly smaller compared to conventional keyboard. It's quite value for $ set. Seller is very friendly and prompt to answer queries. "},
{"rating": 5, "comment": "Looks more green than blue. Nicer on pic than physical. Got free battery. Prefer usb connection as Bluetooth is not very stable"},
{"rating": 5, "comment": "Looks good! Can’t wait to try it out!!"},
{"rating": 5, "comment": "Very pretty!!  One of the mouse will auto off though"},
{"rating": 5, "comment": "delivery was v fast!!!! like 2-3 days? and the keyboard looks great."},
{"rating": 5, "comment": "Worth it for the space, need to get use to it compare to normal keyboard as first time using"},
{"rating": 5, "comment": "Typing is super nice and product was delivered the next day as i told seller it is urgent. Thanks a lot! Colour is really refreshing:) "},
{"rating": 5, "comment": "js rcvd and i ordered 2 days ago!! super cute, sleek and affordable. didnt rly like the “xinmeng” wording on the mouse so i put a sticker to cover it up 🤓"},
{"rating": 5, "comment": "Received in good condition"},
{"rating": 5, "comment": "Fast delivery!! Love the vibrant colours of the keyboard and mouse!! Need to get use to the feel of the keyboard tho... all in all.. its a good buy!!"},
{"rating": 5, "comment": "Nice colour and fast delivery"},
{"rating": 5, "comment": "Seller reply very fast, when I misplaced my keyboard battery😅."},
{"rating": 5, "comment": "came quickly and works well! it’s a usb plug so easy to set up and only took 2 minutes! "},
{"rating": 5, "comment": "Got it as a gift for my friend! It’s quite affordable, design & the typing sound is nice :)"},
{"rating": 5, "comment": "not bad, decent looking. love the pastel pink color. in addition, they provide good customer service too ☺️"},
{"rating": 5, "comment": "Love the colour and the quality. Not bad and affprdable."},
{"rating": 5, "comment": "The product arrived in bubble wrap and was in good condition. The set included batteries for both the keyboard and the mouse, along with a cleaning brush. The connector that is plugged into the laptop is for both the mouse and the keyboard, but it is still possible to use another mouse with it."},
{"rating": 5, "comment": "came within 2 days, very satisfied with my purchase! thought it was bluetooth so was fumbling with the keyboard for a long time but the usb is inside the mouse!"},
{"rating": 5, "comment": "fast delivery ! \nnot as loud as the usual actto but is good and cheap \nbeautiful colour"},
{"rating": 3, "comment": "ordered yesterday and received today. quiet keyboard. however there is a pen mark on the mouse. sad. if not will give full marks."},
{"rating": 5, "comment": "So beautiful and so easy to use. All buttons are functional. Plug and play. \n\nUpdate: Mouse was faulty so I contacted the customer service and was pleasantly suprised that they offered to send me a brand new set. Really efficient tiptop service."},
{"rating": 5, "comment": "Received the item in 2 working days, really fast. Love the colour and it works well so far!!"},
{"rating": 5, "comment": "Items are well bubble wrap when they reach me and it takes about 4 days to reach me.."},
{"rating": 5, "comment": "yay yay!! Really like this keyboard and delivery was super fast!! Thankyouuuu❤️❤️❤️"},
{"rating": 5, "comment": "Came in good condition within 2 days. First time using a keyboard like this so it’s a bit weird initially but I’ll get used to it eventually, the sound is also slightly louder than in the vid and the mouse cursor is a bit slow but I don’t mind! Nonetheless it’s easy to set up and works, thank you!"},
{"rating": 5, "comment": "Tried for a week now, like it. easy to clean. Usb is hidden inside the mouse and battery provided. I like keyboard typing sound so ok with it. The mouse needs a mouse pad to use and it is too low as it strains the hand. Overall still a good purchase."},
{"rating": 5, "comment": "The colours are so pretty. Happy with purchase. The keys are soft, tapping will do, no need any pressure. Great that only one receiver is required for both mouse and keyboard."},
{"rating": 5, "comment": "Nice colour and clicking isn't very loud. Cute and mouse is usable"},
{"rating": 5, "comment": "Omgeeeeee 🤩🤩I so so so love this keyboard. Looks so preettyyyyyy ❤️❤️ The typing feels good too. Mouse a bit too low for me so I just use my own existing mouse. Fast delivery too. So so happy with this! Thanks seller!"},
{"rating": 5, "comment": "So nice. Fast delivery. Ordered last sunday, delivered today (tuesday). Nicely packed. I love the color as well. Seems working fine. Hopefully the quality is good as well."},
{"rating": 5, "comment": "Colour is nice and came well packed. Delivery was also very quick."},
{"rating": 5, "comment": "very worth the money! feels rly good and is not too noisy when typing"},
{"rating": 5, "comment": "Received in good condition. Placed in a box and bubble wrapped. The color is pretty. Clicking sound is acceptable. Happy with the purchase."},
{"rating": 5, "comment": "SUPER CUTE SUPER CUTE works fine and came super fast also!!!!"},
{"rating": 5, "comment": "Very cute keyboard, keyboard noise was minimal & in fact was very nice to hear! \nCheap price to get a set of keyboard & mouse. It’s wireless indeed. Delivery was quite fast too. \nTested & it works! \nOverall, impressed :)"},
{"rating": 5, "comment": "Item was well received and in excellent quality. Highly recommended! Thank you so much!"},
{"rating": 5, "comment": "Happy with the purchase.  So pretty . My girl likes it a lot."},
{"rating": 5, "comment": "Very good quality with very good price tag!!!  Love the colour combi very much :) Worthy deal.  Fast delivery too!"},
{"rating": 5, "comment": "Placed order on 12/5/2022, received on 13/5/2022.\nThanks for the speed and quality."},
{"rating": 5, "comment": "Easy to fix up and connect. Only downside is it isn’t bluetooth and only one usb controls both devices"},
{"rating": 5},
{"rating": 4, "comment": "good"},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Just received, yet to try. Looks good!"},
{"rating": 5, "comment": "Product received in good condition. Fast delivery too! Nice colour! Yet to try. Hope it  works well. Thanks, seller!"},
{"rating": 3},
{"rating": 5, "comment": "Seller very prompt n efficient! Works perfectly!"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Delivery quite fast. It delivered at the right time cos my laptop keyboard z is not working .. hahahaha .. just nice... it's very easy to use .. like it very much! Thank you seller."},
{"rating": 5},
{"rating": 5, "comment": "Received"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Received in a short period of time, value for money"},
{"rating": 5, "comment": "great purchase! delivery was super fast (less than 2 days) and good packaging:)"},
{"rating": 5, "comment": "Super fast delivery! Works well and love the colour, nice to use and worth the price! Thank you!"},
{"rating": 5},
{"rating": 5, "comment": "I bought this with the intention of surfing on my bed via big screen. But the range is disappointing. My wireless mouse (not from this seller) could be detected from the same range, but keyboard couldnt. Totally defeated the purpose of buying. Nice shade of pink, fast delivery."},
{"rating": 5, "comment": "Super fast delivery, ordered it on a fri and got it on Monday morning. Value for money and keyboard is so pretty. It’s also easy to type on and just the right size. Definitely recommend this."},
{"rating": 5, "comment": "Seller went the extra mile to check for me because I really wanted it in black & I got it :') Thank you so much I really appreciate it <3"},
{"rating": 5, "comment": "The delivery was quick, jsut two days and I’m satisfied with the product as well"},
{"rating": 5, "comment": "Tried it immediately. Works great!"},
{"rating": 5, "comment": "omg i love it sooooo much <33!!!!! was so excited when i received it :) also the delivery was super quick!"},
{"rating": 5, "comment": "Keyboard arrived in 3 days in good condition and wrapped in bubble wrap. Really cute and pretty. Just need to take some time to get used to the round key caps. Came with a battery and USB to insert into the laptop."},
{"rating": 5, "comment": "am really impressed with this!!! I love round buttons and the feel of the keys when u press them ! the only downside is that it is battery powered & not chargeable."},
{"rating": 5, "comment": "Slight difference in the colour as compared the to photo seems a bit darker in real life"},
{"rating": 5, "comment": "Very fast delivery! Love the pink colour! It comes with a free battery n usb. Tq!"},
{"rating": 5, "comment": "Keyboard came in 3 days time (inclusive of new year's day PH), and it's true to the images shared. Highly recommended!"},
{"rating": 4, "comment": "Nice to use. Simple looking and functional. Pretty light too"},
{"rating": 4, "comment": "Looks OK, but this is battery operated, not rechargeable. I hope the battery can stay long."},
{"rating": 5, "comment": "its comfortable to type and delivery came within 2 days!!!!"},
{"rating": 5, "comment": "thought it would arrive quicker but that's ok, very pretty keyboard!"},
{"rating": 5, "comment": "comparison to my 13inch laptop, iPad Air 4 and A4 paper below lolol. So far connection to my laptop is smooth and seamless, but the keys are a bit too loud for my liking - my sis complained that it was distracting as well"},
{"rating": 5, "comment": "Item received in good condition. Comes with battery to operate. Thank you!"},
{"rating": 5, "comment": "Looks good, and feels good."},
{"rating": 5, "comment": "Fast delivery... Considering to get another colour. Thank you"},
{"rating": 5, "comment": "Surprisingly good! Value for money.. The keys are situated just like my laptop's keyboard, I adapted to it really fast.. And for a price that's less than half of retail wireless keyboards.. Thanks seller!!"},
{"rating": 5, "comment": "Loving this keyboard! Love the colour and the silent buttons. Very easy to connect and very smooth keying in.delivery was super fast as well."},
{"rating": 5, "comment": "Very satisfied with this cute keyboard! Got it at a flash sale price. Easy to type on and sounds good but also not super noisy."},
{"rating": 5, "comment": "Received really super fast highly recommend 👍🏼👍🏼😉"},
{"rating": 5},
{"rating": 5, "comment": "Performance:very good!\nBest Feature(s):led lights and clicky sound\nValue For Money:definitely worth every penny!\n\nCheap and good! Space saving keyboard!"},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Item received in good condition. Thanks seller. "},
{"rating": 5},
{"rating": 4},
{"rating": 5, "comment": "Fast delivery. Thanks seller"},
{"rating": 5},
{"rating": 5, "comment": "It's worth to buy. Good. "},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Reasonable fast delivery and good price! \n"},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Received in good condition "},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Delivery was super fast!! Item as described. "},
{"rating": 5, "comment": "100 , very good "},
{"rating": 5},
{"rating": 5, "comment": "Great product and fast delivery"},
{"rating": 5, "comment": "Item came fast and in good order thanks"},
{"rating": 2, "comment": "Late with delivery. Ordered on wednesday. Item arrived to sorting facility on friday and i only received it today, 8 days after, like i ordered from China. I thought it was a classic keyboard with a big enter but it's not. Not worth it. If you need something for proper typing don't buy it. Too soft."},
{"rating": 5, "comment": "Arrived within 2 days with Singpost. Works as described. Has wire and can adjust the height. It's a standard office keyboard but I use it to WFH. Also like the punching sounds when you type."},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 4},
{"rating": 5, "comment": "Response is good and touch is slightly lighter than office keyboards"},
{"rating": 5, "comment": "Fast delivery, good price, good product"},
{"rating": 5},
{"rating": 4},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "item received"},
{"rating": 5, "comment": "Happy"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Fast delivery"},
{"rating": 5, "comment": "Works well"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "The products is genuine and price is reasonable. Delivery is fast as well"},
{"rating": 5},
{"rating": 2, "comment": "Very bad delivery ppl sent to the wrong address 😞"},
{"rating": 5, "comment": "Delivery received on the third day after order. Everything looks okay now."},
{"rating": 5},
{"rating": 4, "comment": "👍🏻"},
{"rating": 5, "comment": "Received in good condition, will buy again!"},
{"rating": 5},
{"rating": 5, "comment": "Delivery was super fast. Received the item in good condition. Tested the keyboard and it was good."},
{"rating": 5, "comment": "Received good condition and using. Its working well "},
{"rating": 5, "comment": "Fast delivery. Happy with the purchase. Hope it will last long. "},
{"rating": 5, "comment": "Fast delivery and received it with good in packing. Will buy again "},
{"rating": 5, "comment": "Not bad keyboard\nLightweight and keys are crisp\nMe like this very much"},
{"rating": 5, "comment": "Received in good condition. Delivery guy was very nice to update that he left the package outside my place as I wasn’t around. Appreciate."},
{"rating": 5, "comment": "Fast delivery. Buying it for office use. \nWill buy more if needed. And definitely will recommend it"},
{"rating": 5, "comment": "Well packed. Good wired keyboard for home use"},
{"rating": 5, "comment": "Good product. No complaint 😀thank you."},
{"rating": 5, "comment": "Fast delivery. Received in good condition after 2 days. Works well. Pleased with purchase."},
{"rating": 5, "comment": "Works well."},
{"rating": 5, "comment": "Good to use and fast delivery.  Thank you."},
{"rating": 5, "comment": "Items received as per specifications."},
{"rating": 5, "comment": "Genuine authentic product! Good quality and fast delivery  and super reasonable price!"},
{"rating": 5, "comment": "Worth to buy at this price."},
{"rating": 5, "comment": "Cheap and good. "},
{"rating": 5, "comment": "received in good order & working condition. logitech is a good brand. thank u! 😊"},
{"rating": 5, "comment": "As described. This is a good and cheap wired usb keyboard. Fast delivery too."},
{"rating": 5, "comment": "Very fast delivery. Satisfied with my purchase. Will recommend to my friends and colleagues."},
{"rating": 4, "comment": "Item was shipped out fast. No frill and working. Minus 1 star for the shitty shopee express delivery guy who dump my laptop outside my house umattended despite my clear and instant instruction to him when he msg me."},
{"rating": 5, "comment": "Fast delivery. Good typing experience. Recommended. "},
{"rating": 4, "comment": "Item received in good condition, it's my urgent purchase for HBL so abit anxious on receiving. Quality is up to the expectations. Thanks. "},
{"rating": 5, "comment": "\nItem delivered within 3 days of ordering. Came in good working condition. Reasonable priced as well.. "},
{"rating": 5, "comment": "Received in good condition. Good for the price. Will recommend."},
{"rating": 4, "comment": "Fast delivery, but poor packaging, good quality, generally good enough "},
{"rating": 5, "comment": "Simple logitech keyboard to replace my faulty keyboard..."},
{"rating": 5, "comment": "No bubble packaging in parcel. Basic keyboard and working."},
{"rating": 5, "comment": "Received via Singpost. Normal size keyboard and needless to say, it is ergonomically comfortable to use and typing is quiet."},
{"rating": 5, "comment": "Excellent and cheap product. Definitely worth the buy. Recommend!"},
{"rating": 4, "comment": "Bad experience as the delivery guy knock my door at 12am 12am 12am, my whole family woke up by door bell. It's terrible!!"},
{"rating": 5, "comment": "Box is slightly damaged but no problem with the keyboard. Good deal."},
{"rating": 5, "comment": "Took a while to ship out .. but received in good order.... hope it last.."},
{"rating": 5, "comment": "Items received in good condition and fast delivery. \nValue for the price! \nGood......"},
{"rating": 5, "comment": "Received in good conditions."},
{"rating": 5, "comment": "Bought this old model again for office use. I'm using this at home and been using for a long time. Although this not as silent, it is very nice to punch on."},
{"rating": 5, "comment": "Item delivered quite fast, within one week. Very comfortable when typing on keyboard."},
{"rating": 5, "comment": "Reasonable price. Waited 3-4 days to arrive. Thank you very much."},
{"rating": 5, "comment": "Keyboard arrived the next working day. Very pleased with the prompt delivery. Have tested it and quality is very good for the cheap price. Recommended"},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Next day delivery! Item was well packaged and delivery was smooth."},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Cheap and good quality. Prompt service and fast delivery. Thank you to the seller."},
{"rating": 5, "comment": "Fast delivery and very good to use."},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Very 👍 thanks"},
{"rating": 5, "comment": "Prompt delivery. Product works fine."},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Fast delivery.... Okay to buy next time"},
{"rating": 5, "comment": "pretty good for the price. my mum is using it well. do recommend for this price range."},
{"rating": 5, "comment": "Already using. Very happy about this buy. Highly recommended."},
{"rating": 5, "comment": "good good very fast delivery thank you thank you thank youuu"},
{"rating": 5, "comment": "Yet to test"},
{"rating": 5, "comment": "Keyboard is delivered promptly and is working fine! Happy with my purchase. But one thing to note is that the keys are a bit smaller so may need some time to get used to it!"},
{"rating": 5, "comment": "Relatively fast delivery, very satisfied with the quality of the keyboard"},
{"rating": 5, "comment": "Very fast delivery. Received in good condition. Simple n nice for my daily use"},
{"rating": 5, "comment": "Looks good. Item was wrapped nicely. Delivery was fast too."},
{"rating": 5, "comment": "Fast Delivery and in good condition. Work perfectly highly recommend"},
{"rating": 5, "comment": "Bought it for our work use. Perf!!"},
{"rating": 5, "comment": "Very fast delivery, can get it on next day after placed order. Quite normal model and suitable for office use. "},
{"rating": 5, "comment": "Ordered on 25/10 and received on 30/10. Package in good condition."},
{"rating": 5, "comment": "Ordered item on 26 Nov & delivery was in 30 Nov. Took 4 days which is quite reasonable. \nHv used this same keyboard & it works well. Also cheap at $15 if don’t mind the wires. \nHappy with purchase"},
{"rating": 5, "comment": "Quite a good quality keyboard. A must-have for work from home. The delivery is fast enough."},
{"rating": 5, "comment": "Order placed on Saturday and received it on Tuesday. Delivery is fast and really appreciate it. Item works fine. "},
{"rating": 5, "comment": "Fast delivery! Ordered on Sunday night and received on Tuesday afternoon. Working fine and the led indicators are also funationing well. Love the softer keys as compare with the standard ones and the feel is good."},
{"rating": 5, "comment": "Item delivered as advertised and very fast delivery! Good buy"},
{"rating": 5, "comment": "Received in good condition. The box was just wrapped in plastic bag/sheet though."},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 3, "comment": "a lil bent but issokay ."},
{"rating": 5, "comment": "both working very well!now I don’t have to always bring my heavy laptop to school because the weight of it is more lighter 😊"},
{"rating": 3, "comment": "Arrived earlier than expected.\n\nWorks well. \n\nSlender and small keyboard."},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "i like it! has a sleek feel and really nice to type on, i like the clicking sounds. came fast as well, overall good"},
{"rating": 5, "comment": "My son love it..good"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Thank you"},
{"rating": 5, "comment": "Order received in good condition"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Good. able to connect. but keyboard is arranged like Macbook.. not microsoft/android. that is ok. easy connected easy use."},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Well pack....fast too .\nHope it works well too"},
{"rating": 5, "comment": "Everything works fairly easy. How long will it last don't know but it feels kinda filmsy."},
{"rating": 4},
{"rating": 5, "comment": "Very compact. Keyboard is very thin, maybe need to be cautious about breaking it"},
{"rating": 5, "comment": "Fast delivery 👍"},
{"rating": 5},
{"rating": 4, "comment": "Cheap but hard to use"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 1, "comment": "The reason why I give 1 star is because of the sound the keyboard makes when you type and how flimsy it is compared to the quality keyboard you use on ur laptops but I guess you get what u paid for"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Good products except delivery Abit slow"},
{"rating": 3, "comment": "Item received well. Hope will last. Delivery was rather long"},
{"rating": 5, "comment": "👍 my gal like it ."},
{"rating": 5},
{"rating": 5},
{"rating": 3},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "It is very useful :D"},
{"rating": 5},
{"rating": 5, "comment": "Thanks Seller, is Bluetooth function, fast delivery"},
{"rating": 5},
{"rating": 4},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 3},
{"rating": 5},
{"rating": 4},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Thank you for the fast delivery. Keyboard and mouse well packed. It was user friendly gadgets. *****😀"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Exact like photo"},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Good"},
{"rating": 5, "comment": "Not bad, decent. Can buy if there's offer but maybe not at full price."},
{"rating": 5, "comment": "New keyboard in sweet pink. Thank you! Now I can type properly and work on my Ipad."},
{"rating": 5, "comment": "Very nice! Tried and work fine with my mac computer! Waited a little long for it to arrive!"},
{"rating": 5, "comment": "Used for a few minutes. So far so good. \n\nGood choice of commands, convenient. \n\nCan't complain for the price.\n\nOnly wish there was a bigger model."},
{"rating": 5, "comment": "Worth the purchase, matte finishing and minimal sound."},
{"rating": 5, "comment": "received in 5days.. \nworks well"},
{"rating": 5, "comment": "Delivery was okay pretty fast, connection was very easy keyboard felt really light and cheap, but highly recommend as it works just fine."},
{"rating": 5, "comment": "ordered on 31st oct received on 9th Nov. Took longer then others but oh well.\nQuite easy to connect and keyboard was bubble wrapped up to prevent damages to keyboard 👍🏻"},
{"rating": 5, "comment": "the quality is great for its price!! :)"},
{"rating": 5, "comment": "Product received, working well and connect easily"},
{"rating": 5, "comment": "It's a lot of packaging since it does not have a box. Looks good. Hopefully it works"},
{"rating": 5, "comment": "Good price with good quality!!"},
{"rating": 5, "comment": "Item received in good condition. The yellow Color keyboard is so pretty."},
{"rating": 5},
{"rating": 5, "comment": "Keyboard and mouse received fast, i can easily paired with my ipad8 easily, i like the colour so much !!!!"},
{"rating": 5, "comment": "Item looks good can’t wait to use it"},
{"rating": 5, "comment": "Nicely wrapped however there was a dent at the bottom of the keyboard. The clacking sound when typing is loud but nevertheless still does the job well & easy to connect."},
{"rating": 5, "comment": "received my keyboard in good condition! i tested in on my ipad and its easy to connect. connected by bluetooth! I can type and use it! It came wrapped with bubble wrapps but no box."},
{"rating": 4, "comment": "I mean it works as a keyboard and mouse. But quality wise, for sure you can’t compare it to Phillips etc. The type feel is a little less sturdy (a little flimsy) and for the one I received, the Control key is tilted. Hope it can last for at least two years."},
{"rating": 5, "comment": "Nice item. The color is nice. Came without box but seller bubble wrapped and overlay with another firm bubble wrapping so it feels very secure. Have yet to try if it works."},
{"rating": 5, "comment": "fit on the case of my ipad 11 inch perfectly, very light, easy to connect and usable. the keys abit wonky but not bad for it’s price. came nicely wrapped as well :)"},
{"rating": 5, "comment": "the keyboard was really well secured and very pretty! just tried and it works well too. easy to connect"},
{"rating": 5, "comment": "Delivery was well packaged with bubble wrap! Tried and it works but the space bar is not very sensitive. Good for the price!!"},
{"rating": 5, "comment": "Nice colour, light weight. Recommended to all."},
{"rating": 4, "comment": "Goods received. Item is compatible for iPad gen 9 . However is abit flimsy and not so stable when typing must put something at the bottom so that it doesn't move but overall is a good buy."},
{"rating": 5, "comment": "Receive the item . No box , however it is wrap nicely and protect with bubble wrap. It is functional ."},
{"rating": 5, "comment": "Wrapping was done well & product arrived in excellent condition.  Thanks!"},
{"rating": 5, "comment": "Reach the item already, like it thank you"},
{"rating": 5, "comment": "Love the colours and very easy to plug and use. Perfect as a gift"},
{"rating": 5, "comment": "Nice . Working well!"},
{"rating": 5, "comment": "Product is working very well! Very easy to connect as well! Am pleased with it :)"},
{"rating": 5, "comment": "Working great on iPad Air 3"},
{"rating": 5, "comment": "really realllt good honestly super happy with this product and it’s service"},
{"rating": 4, "comment": "Read the note in the video and photo for the review. Overall not bad for the price. \nEdit: just realised in the photo review I saw cab instead of can't"},
{"rating": 5, "comment": "I been using this for a year and it still able to use and great service 😃"},
{"rating": 5, "comment": "Got the product real quick! Ordered on 8/11 and received it on 14/11~\nKeyboard and mouse works great~\nNo lags in typing, mouse is sensitive too~"},
{"rating": 5, "comment": "Works well! Really like it hehe the keys are working and connecting through Bluetooth was fast and simple. Delivery was pretty fast, a week or so for standard economy :D"},
{"rating": 5, "comment": "Fast delivery with good condition. Customer service is good."},
{"rating": 5, "comment": "nice"},
{"rating": 5, "comment": "Items received in good condition,bubble wrapped. Delivery was fast seeing that I ordered it last but received it 1st before others that I ordered. Tested the keyboard with my Samsung A7 Lite and it works well. Don't have AA battery for the mouse so didn't get a chance to test it. Love the colour ❤"},
{"rating": 5, "comment": "Delivery was quite fast consider it is oversea seller. Shopee express collection point at Fu Lu Shou Complex."},
{"rating": 5, "comment": "working well with my macbook! nice colour too! super light weight and convenient to bring around. mouse uses double A battery 👍🏼 while keyboard is rechargeable"},
{"rating": 5, "comment": "Super like!! Received in very good condition double layer of bubble wrap. I like the colour very much! And the touch too! Good buy!"},
{"rating": 5, "comment": "Good product quick and fast delivery…. Colour material looks good… would recommend anyone keen …."},
{"rating": 5, "comment": "Received in good order and condition. Small and compact. Easy to use. Connect bluetooth"},
{"rating": 5, "comment": "Item arrived safely in big bubble wrap! Tried connecting to my laptop and it works."},
{"rating": 5, "comment": "Pretty small, just nice for small hands. Thanks seller. Working well. The back is rather slippery."},
{"rating": 5, "comment": "Quality of item was great. Quality of the wrapping was good. Fantastic delivery"},
{"rating": 5, "comment": "Item looked as advertised. Quite sleek. Have not try yet. Value for money."},
{"rating": 5, "comment": "Items is as description. Will purchase again if needed. Highly recommended."},
{"rating": 5, "comment": "very well protected. nice and pretty keyboard. only thing is the typing sound is a bit loud."},
{"rating": 5, "comment": "Just received item. Loved the color. Easy to connect to my android tab."},
{"rating": 5, "comment": "Wrapped well in bubble wrap. No box, but it works ok so doesnt matter."},
{"rating": 4, "comment": "The shift button keeps falling off >.<\nBut not bad considering the price and the keyboard is pretty :)"},
{"rating": 5, "comment": "Clicking sound is a little loud but the keyboard works well, easy to connect to the laptop, came with a cable for charging, and was nicely protected in bubble wrap."},
{"rating": 5, "comment": "Item was wrapped properly and came in good condition………….."},
{"rating": 5, "comment": "Item well received in bubble-wrap. Tested and working well. Does not seem lagging. Happy with the purchase. Thank you and thumbs up!"},
{"rating": 5, "comment": "Solid product. Well made product. Value for money too. Can buy again in future."},
{"rating": 5, "comment": "Very slim and easy to carry around! Can connect to my iPad and smart tv! Easy to connect to devices!"},
{"rating": 5, "comment": "Bought as a gift, received in good condition as it was well wrapped with bubble wrap!!"},
{"rating": 5, "comment": "Items received in good working condition. My daughter love the  pinky keyboard & Mouse 🐁🐭."},
{"rating": 5, "comment": "Both items worked and easy to connect to main devices via Bluetooth 🤗 super lightweight and the mouse clicks are indeed silent 👏🏻 for this price point, it’s definitely worth buying"},
{"rating": 5, "comment": "Wireless Bluetooth Keyboard and mouse full set mobile phone iPad tablet laptop learning\n\nFast delivery \n\nThanks seller"},
{"rating": 5, "comment": "Feels light & flimsy… yet to try out if gd… so far keys are easy to press"},
{"rating": 5, "comment": "Order received. It is nice and good to use. The delivery is fast. Will order again if needed."},
{"rating": 5, "comment": "Received in good condition.smooth keyboard and very lightweight.."},
{"rating": 5, "comment": "WOW it really works! thank you , this literally save my life since my keyboard was working weirdly"},
{"rating": 5, "comment": "Looks really cute and small. I am going to pair it with my smart tv. Hope it works well"},
{"rating": 5, "comment": "Received in good order. Tested, it is working well hope it last. Thanks"},
{"rating": 5, "comment": "Works well and delivered in 4 days! Very portable and convenient to use."},
{"rating": 5, "comment": "Nice to type on, works well, can pair to iPad and Mac well"},
{"rating": 5, "comment": "Cute keyboard, nice colour. Works well, perfect for my desk."},
{"rating": 5},
{"rating": 5, "comment": "Fast delivery and received in good condition..\nLooks good but have not yet tested..✌️"},
{"rating": 5, "comment": "Item was very well protected with thick bubble wrap. Works well with my ipad. But the keyboard is a bit small and the keys are very close to one another."},
{"rating": 5, "comment": "super quick delivery, very pleased! colour is nice and all the keys work <3"},
{"rating": 5, "comment": "works perfectly fine, hopefully this can last for more than a month"},
{"rating": 5, "comment": "Works well and is useful. Recommended to get from the seller."},
{"rating": 5, "comment": "Very nice and thanks for the free gifts."},
{"rating": 5, "comment": "Happy & satisfied with my order. Tks to supplier for the fast delivery & well protected packing of the keyboard & mouse 👍🏻👌🏻"},
{"rating": 5, "comment": "Best Feature(s):fast delivery, order today received tmr\nValue For Money:cheap n good\nPerformance:excellent\n\nhighly recommmend this seller n item. super fast delivery. order today, received tmr. and the keyboard works really well."},
{"rating": 5},
{"rating": 5, "comment": "Received items in good condition, fast delivery"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Performance:Perfect\n\nReceived in good condition, received quickly.\nGood to type, is silent type.\nLove it!"},
{"rating": 5, "comment": "Item was dispatched within 1 working day.\nItem as it is, nice colours.\nWireless dongle shared with mouse\nSheen in appearance"},
{"rating": 5, "comment": "Shipment was very fast.  Received in 2 days. \nKeyboard was easy to setup, just find the usb in mouse.\nVery happy with the purchase, very good price!"},
{"rating": 5, "comment": "No regrets getting this keyboard! Found the right keyboard with proper number pad and arrow keys without sticking together wirh the alphabets. And the colour is just too pretty!"},
{"rating": 5, "comment": "the colour is super cute!! The sound is quite soft & feels pretty good to type! I loved how easy it is to use ! Hope it will last :)"},
{"rating": 5, "comment": "the typing of this is so satisfying & i love it!! highly recommend & it’s super fast in its delivery speed!"},
{"rating": 5, "comment": "Well received,  item is so pretty n sweet , love it."},
{"rating": 5, "comment": "Beautiful ocean blue keyboard mouse combo. Love it. Happy with purchase. Thank you Seller for the free gift..👍👍👍"},
{"rating": 5, "comment": "Performance:works well and connects well\nBest Feature(s):click clack of keyboar\nValue For Money:yes\n\nItems came within one week and works well thanks!"},
{"rating": 5},
{"rating": 3},
{"rating": 5},
{"rating": 5, "comment": "Fast delivery and in good shape. \nItem works"},
{"rating": 5, "comment": "Fast delivery. Product is what I order and  in working condition "},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "I ordered my keyboard & received within 2 days! Efficient! My keyboard is in good condition, light & buttons are clickingly light touch "},
{"rating": 4, "comment": "Pretty keyboard which works well but 1 time key somehow got stuck and kept pressing same letter. Wish the delete key is placed in more prominent position though."},
{"rating": 4},
{"rating": 5, "comment": "very fast delivery & product feel valueable 👍👍"},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Keyboard is good considering the price.👍🏻 recommend"},
{"rating": 5},
{"rating": 5, "comment": "Nice, simple and fast delivery 👍🏻"},
{"rating": 5, "comment": "Fast delivery, got it within 2 days. Item received in good condition"},
{"rating": 5, "comment": "Fast and everything working in order"},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Smooth and types easy"},
{"rating": 5, "comment": "fast delivery & works well even on macbook air"},
{"rating": 5, "comment": "Received in good condition & fast delivery"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Great keyboard. Soft keys and smooth typing."},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 4, "comment": "It’s does not have the smoothest typing experience but can’t complain much for the price! Still a decent buy"},
{"rating": 1, "comment": "My Esc key doesn't work at all. The key also not very good to type."},
{"rating": 5, "comment": "Prompt delivery and came within 3 days! It's a little bit shaky because the bumps at the back were slightly unbalanced but its not that big of a deal. Really compact and takes up little space too!"},
{"rating": 5},
{"rating": 5, "comment": "Great keyboard compact yet full keyboard great great great"},
{"rating": 5, "comment": "Good to use."},
{"rating": 5},
{"rating": 5},
{"rating": 3},
{"rating": 5, "comment": "Received the next day.  Product works as expected."},
{"rating": 5},
{"rating": 4, "comment": "Keys are soft and easy to press. But not used to it as buttons slightly smaller than the usual squarish ones. Didn’t check properly that there’s no Home, Del, etc buttons. Need to take some time to get used to it."},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Well received and it works. "},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Happy with the product, prompt service and fast delivery. Thank you to the seller. "},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Goods Products."},
{"rating": 5},
{"rating": 5, "comment": " Fast delivery Good product quality"},
{"rating": 5},
{"rating": 5, "comment": " Fast delivery Good product quality Excellent service by seller"},
{"rating": 5},
{"rating": 5, "comment": "Fast delivery, item well received and well functioned. Worth the price"},
{"rating": 5},
{"rating": 5, "comment": "Nice and good, worth the price! "},
{"rating": 5, "comment": "Not bad with quality \nWould recommend value for money "},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Fast delivery. Keyboard works well."},
{"rating": 2, "comment": "Rating this a 2 because seller was not responsive after i released payment only to realize alphabets 'a' and 'z' were faulty, on off couldnt type out n mainly couldnt type out for the rest of the day. I requested for exchange or refund or fix (given the mentioned 2 yr warranty), but no response."},
{"rating": 5},
{"rating": 5, "comment": "Good"},
{"rating": 5},
{"rating": 4, "comment": "Deliveey took awhile.. quite comfy to use..............."},
{"rating": 5},
{"rating": 5, "comment": "Good price good keyboard"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Good buy love it but noisy....😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😭😭😭😭😭😭😭😭😭"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 4, "comment": "Compact n small for the price OK. Smooth typing. Words r small tho not for suitable seniors."},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "The keyboard is working fine, but the plastic material used does not match my expectation, but given the low price, it is a satisfied deal"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Nice to use. Colour as per picture. Will purchase again. Thank you seller"},
{"rating": 5, "comment": "Amazing. Works immediately upon plugging into laptop👍"},
{"rating": 5, "comment": "Self collected Item was in original packaging and was shrink wrapped. Looks good too."},
{"rating": 5, "comment": "Received in good condition,  well packing no damage.  Will shop again. Ty"},
{"rating": 5, "comment": "Working well so happy can use my laptop again. Tnx seller"},
{"rating": 5, "comment": "Delivery is fast n the keyboard quality is good. No regret buying n the price is cheap"},
{"rating": 5, "comment": "Well received "},
{"rating": 5},
{"rating": 5, "comment": "Good quality!! Working well :)"},
{"rating": 5, "comment": "Nice color and easy to type too. Very affordable price. Satisfied with the purchase."},
{"rating": 5, "comment": "The delivery is fast and the product is good.\nthe color is good and we like it a lot."},
{"rating": 5, "comment": "Nice😍"},
{"rating": 5, "comment": "Looks good, feels good. Delivery was quick. Overall satisfied"},
{"rating": 5, "comment": "value for money"},
{"rating": 3, "comment": "I actually ordered white, but the delivery came black colour. But keyboard works fine "},
{"rating": 5, "comment": "Keyboard even works with my Xbox One for imputing cheat codes! Lightweight keyboard with quiet buttons and the colors are unbearably beautiful. Very fast shipping too. Very satisfied with the product."},
{"rating": 5, "comment": "Item came quickly and in good condition "},
{"rating": 4, "comment": "Item took 8 days to deliver and box was also dented on the edge as can see from photo, packing can be improved to avoid such a damage....luckily keyboard was working fine after testing. "},
{"rating": 5, "comment": "delivery took less than 3 days to reach and it is wrapped carefully! the colour is actually more towards green than blue / turquoise but other than that, everything else is working fine, so no complaints (: "},
{"rating": 5, "comment": "Fast delivery. Received the box in good condition just that the sealing tape was already open when I received it. I have tried the keys, so far it is working well. I would recommend it. "},
{"rating": 5, "comment": "Very sweet pink color, soft button. Like it. "},
{"rating": 5, "comment": "Received the next day! Soft keys. Good value."},
{"rating": 5, "comment": "Item received very fast. Nice to use wired keyboard. "},
{"rating": 5, "comment": "Packed well and fast delivery. Nice to type. Working condition. "},
{"rating": 5, "comment": "Item received. Item as described. Item received a few days after purchase.\n\n"},
{"rating": 5, "comment": "Nice color, quality good for the price. Delivery is quite fast too."},
{"rating": 5, "comment": "Delivery was fast and convenient via ninja collection at nearby 7-11 outlet. Didn't realise it doesn't contain the additional 6 keys (didn't see description clearly) but it's sweet. "},
{"rating": 5, "comment": "Ordered on Friday? Came on Tuesday. Fast delivery! Keyboard arrived in good condition. Hope all keys are working! And just noticed that the Backspace is called “oops!” haha so cute"},
{"rating": 5, "comment": "Fast and quick delivery. Item worked as expected. Decent for the price."},
{"rating": 5, "comment": "2nd purchase for this keyboard. No issue. Serves its function and additional keyboard for my big monitor"},
{"rating": 5, "comment": "Bought 2 keyboards. Came in waterproof wrapping. Easy to type \nThank you Seller.\nWill consider buying again in the future."},
{"rating": 5, "comment": "Item received in good condition, good good good highly recommend."},
{"rating": 5, "comment": "Awesome fast delivery n gd quality tho 👍"},
{"rating": 5, "comment": "Very pretty"},
{"rating": 5, "comment": "Fast delivery.\nBought for wife, she liked it."},
{"rating": 5, "comment": "Well received. Good product quality. Satisfied with my purchase "},
{"rating": 5, "comment": "Delivery came in a day and product works well. Great for its price."},
{"rating": 5, "comment": "The Bluetooth is not working."},
{"rating": 5, "comment": "Nice keyboard,loving the soft buttons.thanks seller!"},
{"rating": 4, "comment": "fast delivery and nice keyboard. except for the font type that makes it difficult to read initially."},
{"rating": 5, "comment": "Fast delivery, item looks goods."},
{"rating": 5, "comment": "quick delivery! ordered 2 days ago & received it today ! keyboard in good & working condition. all keys are working too ! would recommend. :)"},
{"rating": 5, "comment": "Ordered on 13/12/21, received on 16/12/21 consider  fast. Keyboard in good condition, yet to try."},
{"rating": 5, "comment": "Received within a week! Super fast delivery, looks cute, note that it comes with a wire haha didn’t read the description properly 🙈"},
{"rating": 5, "comment": "Received in good condition. Second time buying this keyboard. Good value for money as this keyboard can be used for a long time (my old one still works, just that printing on the keys have faded away)."},
{"rating": 5, "comment": "Received with good condition, except two key dropped off. I fixed them back to keyboard and it works fine for my Mac Mini."},
{"rating": 5, "comment": "Size just nice. Great for using as a spare keyboard for office use"},
{"rating": 5, "comment": "Delivery was quite fast, buttons not very loud which was what I wanted."},
{"rating": 5, "comment": "received within 2 days! highly recommended to all. keyboard typing is smooth also!"},
{"rating": 5, "comment": "Love the model! It’s soft and nice to use. Had a wireless keyboard but had to change since company doesn’t allow and this is cheap and nice"},
{"rating": 5, "comment": "Box arrived nicely wrapped with bubble wrap. Keyboard works as intended. Keys are easy to press, and are fairly quiet when typing at moderate speed."},
{"rating": 5, "comment": "Smooth typing and function seamlessly. All keys are in working order."},
{"rating": 5, "comment": "Ordered on 24th and came on 26th. Everything is in great condition!"},
{"rating": 5, "comment": "worth the price! works well, though you might need to type a little harder than normal keyboards, but it's still okay :-) love the colour!!!! bought at $8.90, received in a few days"},
{"rating": 5, "comment": "Received it in good condition. So far so good. Worth the money. But don’t ever expect and compare to good quality one."},
{"rating": 5, "comment": "Working well! Worth it for a simple functional one. Would recommend."},
{"rating": 4, "comment": "Prompt delivery after 3 working days. Basic keyboard. Works well for me considering price paid"},
{"rating": 5, "comment": "Fast delivery and received with good condition and thank you seller"},
{"rating": 5, "comment": "Good quality, fast to type, easy USB link up. Would recommend as cheap and reliable. "},
{"rating": 5, "comment": "Item is very valuable and good. Keyboard is not loud abs rather quiet which is good for office use. Will recommend! "},
{"rating": 5, "comment": "been using it for like 3 days, so far no problems. I think it’s rly a worthy purchase!! Also thanks to delivery man for delivering it at 11.30pm."},
{"rating": 5, "comment": "Very fast delivery. I like the colour. The back space key is replaced by “Oops!” Which is quite funny. It’s clicking keyboard and has a nice feel. "},
{"rating": 5, "comment": "keep in mind that the switches are silent ! if you want a clicky keyboard this isnt for you :)\n\namazing love it 10/10 so pretty wow i rly love it thanks seller sm\n\nthis is so ᶜᵘᵗᵉ and the buttons are so satisfying to press"},
{"rating": 5, "comment": "Super fast delivery and exactly the same as the pictures shown."},
{"rating": 5, "comment": "Received in good working condition. Hope will last a long time. "},
{"rating": 5, "comment": "Bought it during the 6.6 sale at $6.. definitely worth the purchase. Keyboard is light and keys are easy to press. Design is very chic."},
{"rating": 5, "comment": "Delivery was veryvery fast. Has slight bump at the back of keyboard so it does not lay too flat which is what I prefer. Tried and each letter works. A semi-silent keyboard. Worth the purchase. Hope it lasts. "},
{"rating": 5, "comment": "Happy with the purchase! Price is reasonable as well. Tried and it doesn’t make much sound. Good buy!"},
{"rating": 5, "comment": "Received the item promptly and quite fast delivery in 2 days time, keyboard was nice just that too silent, i like it keyboard with a feedback sounds haha, overall is a good purchase."},
{"rating": 4, "comment": "Fast delivery and keyboard is not bad but spacebar is not sensitive"},
{"rating": 5, "comment": "For the price it's consider good product. However the key will sometimes stuck. Maybe can look into it. Overall still worth it."},
{"rating": 5, "comment": "Pretty, soft rubbery keys, looks like a toy! Silent and not bad to type, though sometimes not so sensitive, miss a few letters if type too fast, need to type w some effort. But good! Better than my old one. Received in 2 days, fast! New addition to my home office:)"},
{"rating": 5, "comment": "Delivery was fast, parcel was wrapped securely and it works fine with my computer :)"},
{"rating": 5, "comment": "Product came in good condition. Delivery was pretty quite too. "},
{"rating": 5, "comment": "Recieved the item with thanks. Looks good. Hope it can last."},
{"rating": 5, "comment": "Delivery was fast, received within 4 days. Item works perfectly."},
{"rating": 1, "comment": "VERY BAD SELLER!!! NOT BUYING AGAIN!!! \n\nThere are scratches all over the keyboard, unsightly. Alot of black marks around too. \n\nBad seller. Told seller about scratches and seller just said to wipe it off. How do I wipe off a scratch? \n\nEdit: Seller gave me a 1 star rating? "},
{"rating": 5, "comment": "Received in good condition and fast delivery the price is cheap"},
{"rating": 3, "comment": "Best Feature(s):price is good\nPerformance:ok\n\nStill trying and looks ok. But the print on number side is abit blurry."},
{"rating": 5, "comment": "Performance:good\nValue For Money:not bad. All the keys work well\n\nWell received. Fast delivery"},
{"rating": 5},
{"rating": 5},
{"rating": 4, "comment": "keyboard ok\nmouse ...\nhow much you pay and what you get"},
{"rating": 4, "comment": "came in good condition and fast delivery, thought the mouse had buttons;;; but it didnt come with any"},
{"rating": 5},
{"rating": 2},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 3, "comment": "It’s ok. The mouse is kinda not functioning properly. It double click automatically even though i only click once and it can be distruptive for work"},
{"rating": 5},
{"rating": 5, "comment": "v fast delivery"},
{"rating": 5},
{"rating": 1, "comment": "Delivery service was bad. Shopee always uses the same courier company. They just left the package outside my house. Only when I’m leaving home then I noticed the package outside."},
{"rating": 5},
{"rating": 5},
{"rating": 4},
{"rating": 5, "comment": "Fast delivery"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 4},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Good, cheap worth it! cheap worth it! cheap worth it! cheap worth it! cheap worth it!"},
{"rating": 4},
{"rating": 5, "comment": "Son luv the keyboard set."},
{"rating": 5, "comment": "Vr good"},
{"rating": 1, "comment": "Some buttons dropped off but managed to fix back. No light on keyboard"},
{"rating": 3},
{"rating": 5},
{"rating": 5},
{"rating": 3, "comment": "Kb nice but mouse not so good"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 3},
{"rating": 5},
{"rating": 5},
{"rating": 4, "comment": "FAST DELIVERY & GOOD CONDITION"},
{"rating": 5},
{"rating": 5, "comment": "Amazing keyboard"},
{"rating": 5},
{"rating": 5},
{"rating": 2, "comment": "Why the A W S D letters are bigger than the other letters on the keyboard? And I must add that the letters font on the keyboard are abit ugly. well, for the price, I should have seen this coming."},
{"rating": 5},
{"rating": 5, "comment": "Received with thanks. Look good, yet to try up. Fast delivery. Thank you seller........."},
{"rating": 5, "comment": "Nice and fast delivery😄👍tx u"},
{"rating": 5, "comment": "Omgg love it so muchhh thanks so much for.thr prompt shipping"},
{"rating": 5, "comment": "very nice keyboard, came on time, i think the wrapping cld be bttr but all is good"},
{"rating": 5, "comment": "Great seller to deal with and pleasant transaction and prompt delivery!"},
{"rating": 5, "comment": "Fast delivery, and just love the coloured keyboard."},
{"rating": 5},
{"rating": 5, "comment": "We surprise at the speedy delivery! Just in time for Christmas! Thanks so much! Made my girl's day 🙏🙇‍♀️❣🌲🎅🎁🥳"},
{"rating": 5, "comment": "Ordered 24.12 rcvd 29.12. Tested the keyboard working fine, yet to test the mouse hope it’s working too. Looks good, value for money."},
{"rating": 5, "comment": "Nice lights and feels"},
{"rating": 5, "comment": "Order came in 4 days upon order,  keyboard and mouse works. Fast,  convenient and shipment was well packaged with a box.  Lights are clear also and easy to use.  Only the clicking of mouse is rather loud but overall satisfied with the product"},
{"rating": 5, "comment": "Fast delivery, goods came in well wrapped. And very fast delivery. Very recommendable"},
{"rating": 2, "comment": "Received in barely working condition, keyboard and mouse somewhat unresponsive"},
{"rating": 5, "comment": "good quality \nfast delivery 2 days then come already \nrecommended"},
{"rating": 5, "comment": "So pretty 😍 & 很满意!"},
{"rating": 5, "comment": "Fast delivery. Protected well. Hope it’s good nice nice nice"},
{"rating": 5, "comment": "received item in good condition and well packaged in box too."},
{"rating": 5, "comment": "really fast delivery and received in good condition. quite good for a cheap keyboard."},
{"rating": 5, "comment": "Absolutely design for gaming.Keys are raised high so can hear the perfect clicky sound.Lights very charming!Worth to buy"},
{"rating": 5, "comment": "Received GTX300 gaming keyboard and mouse. Thank you seller."},
{"rating": 5, "comment": "Item received in good condition... Just that I lazy to take picture. Thankyouu Seller.. stay safe!!"},
{"rating": 5, "comment": "Nicely packed,nice keyboard and the mouse too 👍\nSurely recommend 👌 \nThank u for the fast delivery and fast response"},
{"rating": 4, "comment": "Only 1 mode for the light. It either turns on or off. Suitable for gamers who don't want to pay so much for a keyboard and a mouse. Keyboard is thin."},
{"rating": 5, "comment": "really good buy for this keyboard and mouse for its price its so SOO worth it!! would definitely buy it for friends that are gamers or even those who js love the keyboard asmr LOL"},
{"rating": 4, "comment": "For its pricing, its considered not bad quality given there's both keyboard and mouse in this combo. However do take note the keys feels quite plastic and light, so if you prefer harder keys to press on, this would not be suitable. 👍🏻👍🏻 for fast delivery!"},
{"rating": 5, "comment": "Smooth fast working . Hope will last . Using for my laptop document typing ."},
{"rating": 3, "comment": "Keyboard is fine but the mouse is not working well ... If can exchange just a mouse will be good...."},
{"rating": 5, "comment": "Nice gaming keyboard and mouse for my son. My son loves it. Awesome pawsome! 😀"},
{"rating": 5, "comment": "Came less than a week ! Consider fast! Keyboard abit flimsy but look cool w the lights! Thanks Seller!"},
{"rating": 5, "comment": "Received in good condition. Have tested it out, seems fine. Might purchase another keyboard 👍👍"},
{"rating": 5, "comment": "Packaging was flawed but items looks in good condition"},
{"rating": 5, "comment": "Received in good condition, fast  by seller ! Hopefully it can last !"},
{"rating": 1, "comment": "Received  the item  but  volume  adjustment  on keyboard  not working,  seller can't solve my problems"},
{"rating": 3, "comment": "Sad mouse only got light……. Dunno isit cause I using it on Mac….. but still sad.. delivery took awhile too…."},
{"rating": 5, "comment": "Delivery is fast. Its in good condition. Everything works by just plugging in. Lights are fixed position and color, with on/off function. Mouse is sensitive, lights cannot turn off. Everything is plastic and keyboard can actually bend. But overall for the price it works."},
{"rating": 5, "comment": "Performance:ok\nBest Feature(s):ok\nValue For Money:ok\n\nLight and cheap \nSimple plug n play\nCheap plastic \nNo issues\nSimple yet easy"},
{"rating": 5},
{"rating": 4},
{"rating": 5},
{"rating": 5, "comment": "good"},
{"rating": 5, "comment": "I had received a keyboard and mouse in the box as stated. Not sure why other pictures had a mousepad included. The set is worth the price although the keyboard doesn't have a stand so take note! "},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Love this keyboard alot indeed silent but if there is a lifting hinges to raise the keyboard slightly will be perfect but definitely worth the buy... item come fast"},
{"rating": 5},
{"rating": 4},
{"rating": 5},
{"rating": 3},
{"rating": 5, "comment": "Fast delivery and good in condition. Haven't try yet."},
{"rating": 5, "comment": "A basic wired keyboard and mouse at reasonable price"},
{"rating": 4, "comment": "Good one . Works pretty well. But NumPad key LED light doesn't work. It hard to find wether NumPad is on or off."},
{"rating": 5, "comment": "Received in good condition. Fast delivery."},
{"rating": 5},
{"rating": 5, "comment": "Just nice for kids used. "},
{"rating": 5, "comment": "very soft and silent clicks "},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 4},
{"rating": 5},
{"rating": 4},
{"rating": 5},
{"rating": 5, "comment": "got it for my mum who does wfh, came super super quickly and was well packaged and decent for office setting"},
{"rating": 5},
{"rating": 4},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "received in good condition"},
{"rating": 5, "comment": "Fast delivery. Smaller than expected but looks compact. Surprised came w free mouse n mouse pad"},
{"rating": 5, "comment": "Received in good condition. Really silently when use it. Worthy for the price."},
{"rating": 5, "comment": "Fast delivery and good quality "},
{"rating": 5, "comment": "Fast delivery and good condition"},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Good value, fastr delivery"},
{"rating": 5},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Great functional product for the economic price paid :)"},
{"rating": 5, "comment": "Delivered pretty fast. Tried out and it’s working"},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "recieved it the following day 👍👍"},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Good and cheap - worthwhile to buy"},
{"rating": 5},
{"rating": 5, "comment": "Fast delivery and happy with the product.Thank you"},
{"rating": 5, "comment": "Good item , quality item , the delivery service was excellent……….."},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Not bad.. fast delivery.."},
{"rating": 4},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Simple, slim  & doesn't take alot of space."},
{"rating": 5},
{"rating": 5, "comment": "Yet to use"},
{"rating": 5},
{"rating": 5, "comment": "Nice keyboard, recommend............................"},
{"rating": 5},
{"rating": 5},
{"rating": 4},
{"rating": 5, "comment": "quick delivery. feels good :)"},
{"rating": 5},
{"rating": 5},
{"rating": 5, "comment": "Quite a good quality at this price point. The mouse is more silent than the keyboard though. "},
{"rating": 5, "comment": "Order was delivered in 3 days. Can't comment on quality as it was bought for someone else."},
{"rating": 5, "comment": "Look good,fast delivery"},
{"rating": 5, "comment": "Take note, dont have fn key on the left hand side. Otherwise okay price for the product "},
{"rating": 5, "comment": "Comes with mouse pad bonus"},
{"rating": 5, "comment": "It is light and quite silent when typing! Mouse was so-so and has a loud click sound when pressed. Overall, worth the buy. "},
{"rating": 5, "comment": "Received the item. Ok for the price except the cable is short."},
{"rating": 5, "comment": "Keyboard is compact and small and works properly. Mouse also works."},
{"rating": 5, "comment": "Smoothly delivered after placing order. Repeat purchase. Good, soft keyboard with mouse at very reasonable place. Only downside - it's completely flat, i.e. not able to adjust or elevate the height to make it more ergonomic."},
{"rating": 5, "comment": "Well received & all work well. Mouse is silent. Recommended. Thanks"},
{"rating": 5, "comment": "Cheap and good!"},
{"rating": 5, "comment": "Ordered on Monday morning, received on Wednesday afternoon, just in time for my scheduled WFH. Very fast and efficient delivery. Items are as described - mouse and keyboard are silent. Love it. Will recommend to my other colleagues too."},
{"rating": 5, "comment": "Though some delay in the delivery, appreciate the seller for following up and sending the missing parcel. "},
{"rating": 5, "comment": "Item came fast and well packed. Will definitely buy again when needed."},
{"rating": 5, "comment": "Nice to use! Thank you for the free mouse pad!"},
{"rating": 5, "comment": "order received + free gift .  thanks 👌⭐️⭐️⭐️"},
{"rating": 5, "comment": "Item received in good order. Quick delivery. Seems to be working fine so far."},
{"rating": 5, "comment": "Item came in good condition"},
{"rating": 5, "comment": "Very fast delivery, product received as described, comes with a free mousepad.  However, the keyboard can't be angle."},
{"rating": 5, "comment": "Fast delivery. Scary courier handling. Good product, works. Quite silent, nice feels. All good, no worries."},
{"rating": 5, "comment": "Well packaged and fast delivery service. However, the mouse is not very sensitive and need the given mouse pad to work well."},
{"rating": 5, "comment": "Tried and works well so far."},
{"rating": 4, "comment": "Product is cheap, so don't expect much. Key buttons are not well made but luckily does not affect the function"},
{"rating": 5, "comment": "Bought it for my new laptop the keyboard are all working same as the mouse and thanks for the free gift"},
{"rating": 5, "comment": "the delivery was quite fast .. have yet to try the keyboard.."},
{"rating": 5, "comment": "Nice and good. Value for money and very fast shipping. Will recommend to all. Thanks."},
{"rating": 5, "comment": "Well wrapped. The keyboard is totally silent. It comes with a free gift, a pack of mask."},
{"rating": 5, "comment": "Fast delivery. Mouse pad, keyboard and mouse. Everything is fine very good 👍🏻"},
{"rating": 5, "comment": "Great keyboard, silent and works well for everyday use.  Light gaming works well too."},
{"rating": 5, "comment": "Truly a silent keyboard"},
{"rating": 5, "comment": "Silent and great keyboard."},
{"rating": 5, "comment": "Good product, highly recommended. Not tried yet but packaging all intact. Will update once tried the product. Thanks again!!"},
{"rating": 5, "comment": "So far ok. 😊 not sure workable. Test and see how. Thank you very much."},
{"rating": 5, "comment": "Super worth it keyboard/mouse set, and it’s pretty quiet! Thanks for the mousepad!"},
{"rating": 5, "comment": "Keyboard took slightly less than a week to arrive. Comes with a free mouse pad"},
{"rating": 5},
{"rating": 5, "comment": "Fast delivery. Keyboard and mouse are in good working conditions.\n👍👍"},
{"rating": 5, "comment": "Ordered on 11th Aug and received on 17th Aug. Keyboard is working fine but not the mouse is."},
{"rating": 5, "comment": "Come in proper wrapped. Free mouse pad.  Looks good. Yet to try at office. Keys are soft and no sound."},
{"rating": 5, "comment": "Fast delivery with proper packaging and no damage to product"},
{"rating": 5, "comment": "Light and silent. Only thing that can be improved on is to have a stand for the keyboard. It's quite flat for my liking as it will make my wrist hurt after using a long time"},
{"rating": 5, "comment": "so fast delivery thank yous so much seller i used it immedialtely i like it"},
{"rating": 5, "comment": "Fast delivery. Yet to use them. Hope will be good."},
{"rating": 5, "comment": "Keyboard and mouse looks good and quality is not bad still got free mouse pad"},
{"rating": 5, "comment": "Good. Abit slow delivery. Have yet to try. Looks good. Tasty"},
{"rating": 5, "comment": "Cheap and affordable office keyboard. Seller also included a mousepad for free!"},
{"rating": 5, "comment": "Fast delivery and item is well received. I will defentially buy again."},
{"rating": 5, "comment": "good and cheap keyboard, looks like what was marketed, worth it"},
{"rating": 4, "comment": "Great seller. Received quickly. Highly recommended. Practical and reliable keyboard."},
{"rating": 5, "comment": "Didn’t know it would come w a mousepad. Both keyboard and mouse are really quiet~ \n\nAppreciate the freebie too! 🙏🏻"},
{"rating": 5, "comment": "Deliver is fast and in good condition. The touch of the key pad is good and responsive . It come with a wired mouse and mouse pad . Value buy."}
]